{
  "common": {
    "language": "العربية",
    "title": "CC Name - نظام توصية الأسماء المستند إلى الثقافة الصينية القديمة",
    "description": "نظام توصية الأسماء يعتمد على الشعر الصيني القديم والكلاسيكيات ومبادئ وو شينغ وإي جينغ"
  },
  "header": {
    "home": "الرئيسية",
    "surnameculture": "ثقافة الألقاب",
    "about": "من نحن",
    "login": "تسجيل الدخول"
  },
  "home": {
    "slogan": "الحكمة التقليدية · التسمية الحديثة",
    "description": "الجمع بين جوهر الثقافة التقليدية من 'شيجينغ' و'الكتب الأربعة والكلاسيكيات الخمسة' مع الحكمة العميقة من وو شينغ وإي جينغ لإنشاء بطاقة اسم شخصية فريدة لك.",
    "wuxing": "العناصر الخمسة",
    "wuxing_desc": "بناءً على تاريخ ووقت ميلادك، يتم مطابقة سمات العناصر الخمسة بدقة لضمان انسجام اسمك مع قدرك",
    "shijing": "مراجع شعرية",
    "shijing_desc": "استلهام من كتاب الأغاني، ودمج الثقافة الكلاسيكية لإضفاء أهمية ثقافية عميقة على اسمك",
    "wuxing_tooltip": "العناصر الخمسة (المعدن والخشب والماء والنار والأرض) هي نظرية مهمة في الفلسفة الصينية القديمة التي تشرح تكوين العالم الطبيعي وقوانين الحركة والتغيير. تفترض هذه النظرية أن كل شيء في العالم يتكون من العناصر الخمسة، التي تعزز وتقيد بعضها البعض: الخشب يعزز النار، النار تعزز الأرض، الأرض تعزز المعدن، المعدن يعزز الماء، والماء يعزز الخشب. في التسمية، يمكن أن يساعد مبدأ التعزيز والتقييد المتبادل للعناصر الخمسة في موازنة مصير المرء وجلب الحظ السعيد مع تجنب سوء الحظ.",
    "shijing_tooltip": "'شيجينغ' (كتاب الأغاني) هو أقدم مجموعة شعرية في الصين، تحتوي على 311 قصيدة من أوائل سلالة تشو الغربية إلى منتصف فترة الربيع والخريف (القرن الحادي عشر قبل الميلاد إلى القرن السادس قبل الميلاد). يحتوي على دلالات ثقافية غنية، وصور جميلة، وروح إنسانية عميقة. عند التسمية، الاستلهام من التلميحات والصور من 'شيجينغ' لا يعطي الأسماء أساسًا ثقافيًا بعيد المدى فحسب، بل يواصل أيضًا جوهر الثقافة الصينية."
  },
  "form": {
    "title": "ابحث عن اسمك المقدر",
    "birthdate": "تاريخ الميلاد",
    "birthtime": "وقت الميلاد",
    "gender": "الجنس",
    "male": "ذكر",
    "female": "أنثى",
    "neutral": "محايد",
    "surname": "اللقب",
    "surname_placeholder": "أدخل لقبك (اختياري)",
    "surname_error": "الرجاء إدخال 1-2 حرف صيني",
    "date_error": "الرجاء استخدام تنسيق التاريخ الصحيح: سنة/شهر/يوم",
    "submit": "توليد توصيات الأسماء",
    "loading": "جاري التوليد...",
    "timezones": {
      "zi": "ساعة زي (0:00-2:00)",
      "chou": "ساعة تشو (2:00-4:00)",
      "yin": "ساعة ين (4:00-6:00)",
      "mao": "ساعة ماو (6:00-8:00)",
      "chen": "ساعة تشن (8:00-10:00)",
      "si": "ساعة سي (10:00-12:00)",
      "wu": "ساعة وو (12:00-14:00)",
      "wei": "ساعة وي (14:00-16:00)",
      "shen": "ساعة شن (16:00-18:00)",
      "you": "ساعة يو (18:00-20:00)",
      "xu": "ساعة شو (20:00-22:00)",
      "hai": "ساعة هاي (22:00-24:00)"
    }
  },
  "result": {
    "title": "تحليل اسمك",
    "introduction": "بناءً على معلومات ميلادك، قمنا بتوليد توصيات الأسماء التالية لك:",
    "name_recommendation": "الأسماء الموصى بها",
    "five_elements": "تحليل العناصر الخمسة",
    "poetic_reference": "المرجع الشعري",
    "name_meaning": "معنى الاسم",
    "name_score": "درجة الاسم",
    "compatibility": "التوافق مع مخطط الميلاد",
    "cultural_depth": "العمق الثقافي",
    "uniqueness": "التفرد",
    "pronunciation": "جماليات النطق",
    "try_again": "توليد مرة أخرى",
    "back_to_home": "العودة إلى الرئيسية"
  },
  "footer": {
    "copyright": "© 2025 CC Name. جميع الحقوق محفوظة.",
    "privacy": "سياسة الخصوصية",
    "terms": "شروط الاستخدام",
    "contact": "اتصل بنا"
  },
  "feedback": {
    "title": "ملاحظات المستخدم",
    "anonymous": "مستخدم مجهول",
    "name_label": "اسمك (اختياري)",
    "email_label": "البريد الإلكتروني (اختياري)",
    "message_label": "محتوى الملاحظات",
    "submit": "إرسال الملاحظات",
    "submitting": "جاري الإرسال...",
    "thank_you": "شكراً على ملاحظاتك! سننظر بعناية في اقتراحاتك.",
    "continue": "مواصلة تقديم الملاحظات",
    "error_message": "فشل الإرسال، يرجى المحاولة مرة أخرى لاحقاً أو الاتصال بنا عبر وسائل أخرى.",
    "timeout_message": "انتهت مهلة الإرسال، يرجى التحقق من اتصال الشبكة لديك والمحاولة مرة أخرى."
  },
  "about": {
    "title": "من نحن",
    "intro": {
      "p1": "نحن فريق مكرس لوراثة الثقافة الصينية التقليدية، ونركز على تقديم خدمات توصية الأسماء ذات التراث الثقافي.",
      "p2": "من خلال الجمع بين مبادئ التسمية التقليدية وتحليل البيانات الحديثة، نقدم خيارات أسماء فريدة وذات معنى لكل عائلة."
    },
    "philosophy": {
      "title": "فلسفتنا",
      "item1": "احترام التقاليد، وراثة الثقافة",
      "item2": "التحليل العلمي، توصيات دقيقة",
      "item3": "خدمة احترافية، رعاية مخلصة"
    },
    "advantages": {
      "title": "مزايانا",
      "team": {
        "title": "فريق محترف",
        "description": "فريق محترف ذو خبرة سنوات في التسمية، متعمق في جوهر الثقافة التقليدية"
      },
      "method": {
        "title": "طريقة علمية",
        "description": "الجمع بين الثقافة التقليدية وطرق التحليل الحديثة لتقديم أفضل التوصيات لك"
      }
    },
    "contact": {
      "intro": "إذا كان لديك أي أسئلة أو اقتراحات، فلا تتردد في الاتصال بنا",
      "email": {
        "title": "البريد الإلكتروني"
      }
    }
  },
  "surname": {
    "title": "ثقافة الألقاب الصينية",
    "subtitle": "استكشف خمسة آلاف سنة من أصول الألقاب، ورث بصمة الحضارة الصينية",
    "banner": {
      "alt": "تاريخ ألقاب المائة عائلة"
    },
    "wiki_link": "استكشف المزيد من الألقاب من ويكيبيديا",
    "origin": {
      "title": "أصل وتطور الألقاب",
      "description": "ثقافة الألقاب الصينية لها تاريخ طويل يمكن تتبعه إلى العصور القديمة. في البداية، كان هناك تمييز بين 'شينغ' (姓) و'شي' (氏): كان 'شينغ' يمثل علاقات الدم، بينما كان 'شي' يشير إلى المكانة الاجتماعية أو المنطقة الجغرافية."
    },
    "distribution": {
      "title": "ألقاب المائة عائلة والتوزيع الإقليمي",
      "ranking": "تصنيف الألقاب",
      "ranking_desc": "الألقاب الأكثر شيوعاً في الصين حالياً هي لي، وانغ، زانغ، ليو، تشن، إلخ. يعكس توزيع وهجرة هذه الألقاب حركة السكان والتكامل الثقافي عبر التاريخ الصيني.",
      "regional": "الخصائص الإقليمية",
      "regional_desc": "تختلف الألقاب الشائعة في المناطق الجنوبية عن تلك الموجودة في الشمال، وهو أمر مرتبط ارتباطًا وثيقًا بموجات الهجرة التاريخية والبيئة الجغرافية والتقاليد الثقافية."
    },
    "navigation": {
      "title": "التنقل السريع",
      "origin": "أصول الألقاب",
      "distribution": "التوزيع الإقليمي",
      "culture": "ثقافة الألقاب"
    }
  },
  "surnames": {
    "li": {
      "origin": "نشأ من نسل بو يي، الذي اتخذ المنصب الرسمي \"لي\" كاسم عائلي، ثم تغير لاحقاً إلى \"لي\". تقول نظرية أخرى أنه نشأ من الإمبراطور ياندي (شينونغ).",
      "history": "لي هو أكثر اسم عائلي شيوعاً في الصين. أشهر سلالة لي في التاريخ كانت سلالة تانغ، التي أسسها لي يوان. كان اسم لي شائعاً بالفعل خلال فترتي الربيع والخريف والدول المتحاربة، ووصل إلى ذروته خلال سلالة تانغ.",
      "distribution": "موزع في جميع أنحاء البلاد، وخاصة في شنشي وقانسو",
      "famousPeople": {
        "liBai": "لي باي",
        "liQingZhao": "لي تشينغ تشاو",
        "liShangYin": "لي شانغ ين",
        "liShiMin": "لي شي مين"
      }
    },
    "wang": {
      "origin": "نشأ من العصور القديمة، وهو أحد أقدم الأسماء العائلية. تقول الأسطورة أنه كان يستخدم من قبل نسل وانغ هاي.",
      "history": "وانغ هو ثاني أكثر اسم عائلي شيوعاً في الصين، وكان بالفعل اسم عائلي رئيسي خلال فترة الربيع والخريف. تاريخياً، كان هناك قول \"في العالم، اسم وانغ العائلي لديه 180,000 أسرة\".",
      "distribution": "موزع على نطاق واسع في جميع أنحاء البلاد، وخاصة في شاندونغ وخبي",
      "famousPeople": {
        "wangXiZhi": "وانغ شي تشي",
        "wangWei": "وانغ وي",
        "wangAnShi": "وانغ آن شي",
        "wangYangMing": "وانغ يانغ مينغ"
      }
    },
    "zhang": {
      "origin": "نشأ من العصور القديمة، تقول الأسطورة أنه كان يستخدم من قبل نسل تشانغ هو، مخترع القوس والسهم في عهد الإمبراطور الأصفر.",
      "history": "تشانغ هو ثالث أكثر اسم عائلي شيوعاً في الصين، وكان مزدهراً بالفعل خلال فترتي الربيع والخريف والدول المتحاربة. خلال سلالة هان، ساعد تشانغ ليانغ ليو بانغ في تأسيس سلالة هان، مما جعل اسم تشانغ العائلي أكثر بروزاً.",
      "distribution": "موزع على نطاق واسع في جميع أنحاء البلاد، وخاصة في خنان وشاندونغ",
      "famousPeople": {
        "zhangLiang": "تشانغ ليانغ",
        "zhangFei": "تشانغ فاي",
        "zhangZeDuan": "تشانغ تسي دوان",
        "zhangHeng": "تشانغ هنغ"
      }
    },
    "liu": {
      "origin": "نشأ من اسم جي العائلي، تقول الأسطورة أنه كان يستخدم من قبل نسل الإمبراطور الأصفر. تلقى ليو لي اسم ليو لقدرته على ترويض خيول التنين.",
      "history": "ليو هو رابع أكثر اسم عائلي شيوعاً في الصين. كانت أشهر سلالة ليو في التاريخ هي سلالة هان، التي أسسها ليو بانغ واستمرت لأكثر من 400 عام.",
      "distribution": "موزع على نطاق واسع في جميع أنحاء البلاد، وخاصة في خنان وشاندونغ وآنهوي",
      "famousPeople": {
        "liuBang": "ليو بانغ",
        "liuBei": "ليو باي",
        "liuYuXi": "ليو يو شي",
        "liuShaoQi": "ليو شاو تشي"
      }
    },
    "chen": {
      "origin": "نشأ من اسم غوي العائلي، تقول الأسطورة أنه كان يستخدم من قبل نسل الإمبراطور شون. تلقوا الاسم من إقطاعية تشن (هوايانغ الحديثة، خنان).",
      "history": "تشن هو خامس أكثر اسم عائلي شيوعاً في الصين. خلال فترة الربيع والخريف، تم تأسيس دولة تشن. خلال فترة السلالات الجنوبية، كانت هناك أيضاً سلالة تشن.",
      "distribution": "موزع على نطاق واسع في جميع أنحاء البلاد، وخاصة في فوجيان وقوانغدونغ وتشجيانغ",
      "famousPeople": {
        "chenSheng": "تشن شينغ",
        "chenShou": "تشن شو",
        "chenZiAng": "تشن تسي آنغ",
        "chenDuXiu": "تشن دو شي"
      }
    },
    "yang": {
      "origin": "نشأ من اسم جي العائلي، تقول الأسطورة أنه كان يستخدم من قبل نسل شو ليانغ هي، الابن التاسع للملك وين من تشو. تلقوا الاسم من إقطاعية يانغ.",
      "history": "كان اسم يانغ العائلي شائعاً بالفعل خلال فترتي الربيع والخريف والدول المتحاربة. جعل الإمبراطور المؤسس لسلالة سوي، يانغ جيان، اسم يانغ العائلي أكثر بروزاً.",
      "distribution": "موزع على نطاق واسع في جميع أنحاء البلاد، وخاصة في شنشي وسيتشوان",
      "famousPeople": {
        "yangJian": "يانغ جيان",
        "yangGuiFei": "يانغ غوي فاي",
        "yangYanZhao": "يانغ يان تشاو",
        "yangJiang": "يانغ جيانغ"
      }
    },
    "zhao": {
      "origin": "نشأ من اسم ينغ العائلي، تقول الأسطورة أنه كان يستخدم من قبل نسل زاو فو. تلقوا الاسم من مدينة تشاو تشنغ (هونغدونغ الحديثة، شانشي).",
      "history": "اسم تشاو العائلي هو أحد أشهر الأسماء العائلية في التاريخ الصيني. خلال فترة الدول المتحاربة، تم تأسيس دولة تشاو من قبل عشيرة تشاو.",
      "distribution": "موزع على نطاق واسع في جميع أنحاء البلاد، وخاصة في شانشي وخبي",
      "famousPeople": {
        "zhaoWuLingWang": "الملك وو لينغ من تشاو",
        "zhaoKuangYin": "تشاو كوانغ ين",
        "zhaoYun": "تشاو يون",
        "zhaoMengFu": "تشاو منغ فو"
      }
    },
    "sun": {
      "origin": "نشأ من اسم جي العائلي، تقول الأسطورة أنه كان يستخدم من قبل نسل صن شو دو، ابن الملك وين من تشو.",
      "history": "كان اسم صن العائلي شائعاً بالفعل خلال فترتي الربيع والخريف والدول المتحاربة. خلال فترة الممالك الثلاث، أسس صن تشوان دولة وو.",
      "distribution": "موزع على نطاق واسع في جميع أنحاء البلاد، وخاصة في شاندونغ وجيانغسو",
      "famousPeople": {
        "sunWu": "صن وو",
        "sunQuan": "صن تشوان",
        "sunYatSen": "صن يات سين",
        "sunSiMiao": "صن سي مياو"
      }
    },
    "zhou": {
      "origin": "نشأ من اسم جي العائلي، تقول الأسطورة أنه كان يستخدم من قبل نسل جي تشانغ، الملك وين من تشو.",
      "history": "اسم تشو العائلي هو أحد أقدم الأسماء العائلية في الصين، حكام سلالة تشو كانوا يحملون هذا الاسم.",
      "distribution": "موزع على نطاق واسع في جميع أنحاء البلاد، وخاصة في هونان وجيانغشي",
      "famousPeople": {
        "zhouGongDan": "دوق تشو",
        "zhouDunYi": "تشو دون يي",
        "zhouEnLai": "تشو إن لاي",
        "zhouShuRen": "تشو شو رن"
      }
    },
    "wu": {
      "origin": "نشأ من اسم جي العائلي، تقول الأسطورة أنه كان يستخدم من قبل نسل جي فا، الملك وو من تشو. تلقوا الاسم من إقطاعية وو (سوتشو الحديثة، جيانغسو).",
      "history": "كان اسم وو العائلي شائعاً بالفعل خلال فترة الربيع والخريف، تاريخياً كانت هناك دولة وو.",
      "distribution": "موزع على نطاق واسع في جميع أنحاء البلاد، وخاصة في جيانغسو وتشجيانغ",
      "famousPeople": {
        "wuQi": "وو تشي",
        "wuDaoZi": "وو داو تسي",
        "wuChengEn": "وو تشنغ إن",
        "wuJingZi": "وو جينغ تسي"
      }
    }
  }
}
