{
  "common": {
    "language": "বাংলা",
    "title": "সিসি নেম - চীনা সংস্কৃতি ভিত্তিক নাম সুপারিশ সিস্টেম",
    "description": "প্রাচীন চীনা কবিতা, পঞ্চতত্ত্ব এবং যিচিং নীতি ভিত্তিক নাম সুপারিশ সিস্টেম",
    "not_found": "পাতা পাওয়া যায়নি",
    "path_not_exists": "আপনি যে পথে যেতে চেষ্টা করছেন তা বিদ্যমান নেই",
    "page_moved": "এই পাতাটি সরানো বা মুছে ফেলা হয়েছে",
    "back_home": "হোম পেজে ফিরে যান"
  },
  "header": {
    "home": "হোম",
    "surnameculture": "পদবি সংস্কৃতি",
    "about": "আমাদের সম্পর্কে",
    "login": "লগইন"
  },
  "home": {
    "slogan": "ঐতিহ্যবাহী জ্ঞান · আধুনিক নামকরণ",
    "description": "'শিজিং' এবং 'চার বই ও পাঁচ ক্লাসিক্স' থেকে ঐতিহ্যবাহী সংস্কৃতির সারাংশ এবং উ শিং ও ই জিং-এর গভীর জ্ঞানের সংমিশ্রণে আপনার জন্য একটি অনন্য নাম চার্ট তৈরি করা হয়েছে।",
    "wuxing": "পঞ্চ উপাদান",
    "wuxing_desc": "আপনার জন্ম তারিখ ও সময়ের উপর ভিত্তি করে, পঞ্চ উপাদানের বৈশিষ্ট্যগুলি সঠিকভাবে মিলিয়ে আপনার নাম যাতে আপনার ভাগ্যের সাথে সামঞ্জস্যপূর্ণ হয় তা নিশ্চিত করা",
    "shijing": "কাব্যিক উল্লেখ",
    "shijing_desc": "ওডস বইয়ের থেকে অনুপ্রেরণা নিয়ে, ক্লাসিক সংস্কৃতিকে অন্তর্ভুক্ত করে আপনার নামে গভীর সাংস্কৃতিক অর্থ প্রদান করা",
    "wuxing_tooltip": "পঞ্চ উপাদান (ধাতু, কাঠ, জল, অগ্নি, মাটি) প্রাচীন চীনা দর্শনের একটি গুরুত্বপূর্ণ তত্ত্ব যা প্রাকৃতিক বিশ্বের গঠন এবং এর গতি ও পরিবর্তনের নিয়মগুলি ব্যাখ্যা করে। এই তত্ত্ব অনুযায়ী, বিশ্বের সবকিছু পঞ্চ উপাদান দিয়ে গঠিত, যেগুলি একে অপরকে উৎসাহিত ও নিয়ন্ত্রণ করে: কাঠ অগ্নিকে উৎসাহিত করে, অগ্নি মাটিকে উৎসাহিত করে, মাটি ধাতুকে উৎসাহিত করে, ধাতু জলকে উৎসাহিত করে, এবং জল কাঠকে উৎসাহিত করে। নামকরণে, পঞ্চ উপাদানের পারস্পরিক উৎসাহ ও নিয়ন্ত্রণের নীতি ব্যক্তির ভাগ্যকে ভারসাম্যপূর্ণ করতে এবং দুর্ভাগ্য এড়িয়ে সৌভাগ্য আনতে সাহায্য করতে পারে।",
    "shijing_tooltip": "'শিজিং' (ওডস বই) চীনের প্রাচীনতম কবিতা সংকলন, যাতে পশ্চিমা ঝউ রাজবংশের শুরু থেকে বসন্ত ও শরৎকালের মধ্য পর্যন্ত (খ্রিস্টপূর্ব 11ম থেকে 6ষ্ঠ শতাব্দী) 311টি কবিতা রয়েছে। এতে সমৃদ্ধ সাংস্কৃতিক অন্তর্নিহিতার্থ, সুন্দর চিত্রকল্প, এবং গভীর মানবিক চেতনা রয়েছে। নামকরণে, 'শিজিং'-এর ইঙ্গিত ও চিত্রকল্প থেকে অনুপ্রেরণা নেওয়া শুধু নামগুলিকে একটি দূরপ্রসারী সাংস্কৃতিক ভিত্তি দেয় না, বরং চীনা সংস্কৃতির সারমর্মও বজায় রাখে।",
    "hover_for_details": "বিস্তারিত পরিচিতির জন্য হোভার করুন",
    "shijing_quote": "গুয়ান-গুয়ান ডাকছে অসপ্রে পাখিরা, নদীর মধ্যে ছোট দ্বীপে। মিতব্যয়ী, সংযত, সদাচারী, তরুণী: আমাদের রাজপুত্রের জন্য এক উত্তম সঙ্গিনী।",
    "shijing_source": "ওডস বই, গুয়ানজু",
    "classics_in_naming": "নামকরণে ক্লাসিক সংস্কৃতির প্রয়োগ",
    "classics_point1": "শিজিং এবং চুচি-এর মতো ক্লাসিক থেকে সুন্দর চিত্রকল্প আহরণ করা",
    "classics_point2": "নামগুলিকে গভীর অর্থ দেওয়ার জন্য ঐতিহ্যবাহী সাংস্কৃতিক প্রসঙ্গ অন্তর্ভুক্ত করা",
    "classics_point3": "চীনা সভ্যতার সারমর্ম উত্তরাধিকার সূত্রে পাওয়া, প্রাচীন ও আধুনিক সংস্কৃতিকে সংযুক্ত করা",
    "shijing_naming": "একটি ভালো নাম শুধু অক্ষরের সংমিশ্রণ নয়, বরং ঐতিহ্যবাহী সংস্কৃতির উত্তরাধিকার ও উদ্ভাবন।",
    "wuxing_naming": "নামকরণে পঞ্চ উপাদানের প্রয়োগ: ভারসাম্য অর্জনের জন্য জন্ম চার্টের ঘাটতির উপর ভিত্তি করে অনুরূপ বৈশিষ্ট্য সম্পন্ন অক্ষর নির্বাচন করা।",
    "metal_desc": "শক্তিশালী ও দৃঢ়, সিদ্ধান্ত ও শরতের প্রতীক",
    "wood_desc": "বর্ধনশীল ও নমনীয়, উদ্ভাবন ও বসন্তের প্রতীক",
    "water_desc": "প্রবাহমান ও জ্ঞানী, অভিযোজনযোগ্যতা ও শীতের প্রতীক",
    "fire_desc": "আবেগপূর্ণ ও শক্তিশালী, পরিবর্তন ও গ্রীষ্মের প্রতীক",
    "earth_desc": "স্থির ও সর্বগ্রাহী, সামঞ্জস্য ও মৌসুমের শেষের প্রতীক",
    "intro_title": "ঐতিহ্যবাহী চীনা নামকরণ দর্শনের অন্বেষণ"
  },
  "form": {
    "title": "আপনার নিয়তি নির্ধারিত নাম খুঁজুন",
    "birthdate": "জন্ম তারিখ",
    "birthdate_placeholder": "আপনার জন্ম তারিখ নির্বাচন করুন",
    "birthdate_required": "অনুগ্রহ করে জন্ম তারিখ প্রদান করুন",
    "birthdate_invalid": "অনুগ্রহ করে একটি বৈধ জন্ম তারিখ প্রদান করুন",
    "birthtime": "জন্ম সময়",
    "gender": "লিঙ্গ",
    "male": "পুরুষ",
    "female": "মহিলা",
    "neutral": "নিরপেক্ষ",
    "surname": "পদবি",
    "surname_placeholder": "আপনার পদবি লিখুন (ঐচ্ছিক)",
    "surname_error": "অনুগ্রহ করে ১-২টি চীনা অক্ষর লিখুন",
    "date_error": "অনুগ্রহ করে সঠিক তারিখ ফরম্যাট ব্যবহার করুন: বববব/মম/দিদি",
    "submit": "নাম সুপারিশ তৈরি করুন",
    "loading": "তৈরি করা হচ্ছে...",
    "generation_error": "নাম তৈরি করতে ত্রুটি, অনুগ্রহ করে আবার চেষ্টা করুন",
    "form_title": "মৌলিক তথ্য পূরণ করুন",
    "time_range": "জন্ম সময়কাল",
    "time_range_morning": "সকাল (জি শি - মাও শি)",
    "time_range_afternoon": "দুপুর (চেন শি - ওয়েই শি)",
    "time_range_evening": "সন্ধ্যা (শেন শি - সু শি)",
    "time_range_night": "রাত (হাই শি - চৌ শি)",
    "network_timeout_error": "নেটওয়ার্ক অনুরোধের সময় শেষ হয়েছে, অনুগ্রহ করে আপনার সংযোগ পরীক্ষা করুন এবং আবার চেষ্টা করুন",
    "try_again": "আবার চেষ্টা করুন",
    "name_generating": "আপনার জন্য ব্যক্তিগতকৃত নাম সুপারিশ তৈরি করতে আমরা কঠোর পরিশ্রম করছি, অনুগ্রহ করে অপেক্ষা করুন...",
    "almost_done": "প্রায় শেষ হয়েছে, আর একটু সময় লাগবে...",
    "timezones": {
      "zi": "জি শি (0:00-2:00)",
      "chou": "চৌ শি (2:00-4:00)",
      "yin": "ইন শি (4:00-6:00)",
      "mao": "মাও শি (6:00-8:00)",
      "chen": "চেন শি (8:00-10:00)",
      "si": "সি শি (10:00-12:00)",
      "wu": "উ শি (12:00-14:00)",
      "wei": "ওয়েই শি (14:00-16:00)",
      "shen": "শেন শি (16:00-18:00)",
      "you": "ইউ শি (18:00-20:00)",
      "xu": "সু শি (20:00-22:00)",
      "hai": "হাই শি (22:00-24:00)"
    }
  },
  "result": {
    "title": "আপনার নামের বিশ্লেষণ",
    "introduction": "আপনার জন্ম তথ্যের উপর ভিত্তি করে, আমরা আপনার জন্য নিম্নলিখিত নাম সুপারিশ তৈরি করেছি:",
    "name_recommendation": "সুপারিশকৃত নাম",
    "five_elements": "ওউ শিং বিশ্লেষণ",
    "poetic_reference": "কাব্যিক উদ্ধৃতি",
    "name_meaning": "নামের অর্থ",
    "name_score": "নাম স্কোর",
    "compatibility": "ভাগ্যের সাথে সামঞ্জস্য",
    "cultural_depth": "সাংস্কৃতিক গভীরতা",
    "uniqueness": "স্বতন্ত্রতা",
    "pronunciation": "উচ্চারণের সৌন্দর্য",
    "back_to_home": "হোম পেজে ফিরে যান",
    "name_analysis": "ওউ শিং যুক্তি",
    "language_notice": "এই পৃষ্ঠায় ভাষা পরিবর্তন বৈশিষ্ট্য নিষ্ক্রিয় করা হয়েছে। ভাষা পরিবর্তন করতে, অনুগ্রহ করে হোম পেজে ফিরে যান।",
    "elements": {
      "metal": "ধাতু",
      "wood": "কাঠ",
      "water": "জল",
      "fire": "আগুন",
      "earth": "মাটি"
    }
  },
  "footer": {
    "copyright": "© 2025 সিসি নেম। সর্বসত্ত্ব সংরক্ষিত।",
    "privacy": "গোপনীয়তা নীতি",
    "terms": "ব্যবহারের শর্তাবলী",
    "contact": "যোগাযোগ করুন"
  },
  "feedback": {
    "title": "ব্যবহারকারীর মতামত",
    "anonymous": "বেনামী ব্যবহারকারী",
    "name_label": "আপনার নাম (ঐচ্ছিক)",
    "email_label": "ইমেইল (ঐচ্ছিক)",
    "message_label": "মতামতের বিষয়বস্তু",
    "submit": "মতামত জমা দিন",
    "submitting": "জমা দেওয়া হচ্ছে...",
    "thank_you": "আপনার মতামতের জন্য ধন্যবাদ! আমরা আপনার পরামর্শ মনোযোগ সহকারে বিবেচনা করব।",
    "continue": "আরও মতামত প্রদান করুন",
    "error_message": "জমা দেওয়া ব্যর্থ হয়েছে, অনুগ্রহ করে পরে আবার চেষ্টা করুন বা অন্য উপায়ে আমাদের সাথে যোগাযোগ করুন।",
    "timeout_message": "জমা দেওয়ার সময় শেষ হয়ে গেছে, অনুগ্রহ করে আপনার ইন্টারনেট সংযোগ পরীক্ষা করুন এবং আবার চেষ্টা করুন।"
  },
  "about": {
    "title": "আমাদের সম্পর্কে",
    "intro": {
      "p1": "আমরা ঐতিহ্যবাহী চীনা সংস্কৃতি রক্ষা করতে এবং গভীর সাংস্কৃতিক তাৎপর্য সহ নাম সুপারিশ সেবা প্রদান করতে উৎসর্গীকৃত একটি দল।",
      "p2": "ঐতিহ্যবাহী নামকরণ নীতি এবং আধুনিক ডেটা বিশ্লেষণের সংমিশ্রণের মাধ্যমে, আমরা প্রতিটি পরিবারের জন্য অনন্য এবং অর্থপূর্ণ নাম নির্বাচন প্রদান করি।"
    },
    "philosophy": {
      "title": "আমাদের দর্শন",
      "item1": "ঐতিহ্যকে সম্মান করা, সংস্কৃতি সংরক্ষণ করা",
      "item2": "বৈজ্ঞানিক বিশ্লেষণ, নির্ভুল সুপারিশ",
      "item3": "পেশাদার সেবা, আন্তরিক যত্ন"
    },
    "advantages": {
      "title": "আমাদের সুবিধা",
      "team": {
        "title": "পেশাদার দল",
        "description": "বহু বছরের নামকরণ অভিজ্ঞতা সহ পেশাদার দল, যারা ঐতিহ্যবাহী সংস্কৃতির সারমর্ম গভীরভাবে বোঝেন"
      },
      "method": {
        "title": "বৈজ্ঞানিক পদ্ধতি",
        "description": "ঐতিহ্যবাহী সংস্কৃতি এবং আধুনিক বিশ্লেষণ পদ্ধতির সংমিশ্রণ, সেরা সুপারিশ প্রদানের জন্য"
      }
    },
    "contact": {
      "intro": "আপনার কোন প্রশ্ন বা পরামর্শ থাকলে, যেকোনো সময় আমাদের সাথে যোগাযোগ করতে দ্বিধা করবেন না",
      "email": {
        "title": "ইমেইল"
      }
    }
  },
  "surname": {
    "title": "চীনা পদবি সংস্কৃতি",
    "subtitle": "পাঁচ হাজার বছরের পদবির উৎপত্তি অন্বেষণ করুন, চীনা সভ্যতার উত্তরাধিকার",
    "banner": {
      "alt": "বাই জিয়া শিং (একশত পদবি) এর ইতিহাস"
    },
    "wiki_link": "পদবির উৎপত্তি সম্পর্কে আরও অন্বেষণ করুন",
    "origin": {
      "title": "পদবির উৎপত্তি এবং বিবর্তন",
      "description": "চীনা পদবি সংস্কৃতির একটি দীর্ঘ ইতিহাস রয়েছে, যা প্রাচীন কাল পর্যন্ত প্রসারিত। প্রাথমিকভাবে 'শিং' (姓) এবং 'শি' (氏) এর মধ্যে পার্থক্য ছিল: 'শিং' রক্তের সম্পর্ক প্রতিনিধিত্ব করত, যখন 'শি' সামাজিক মর্যাদা বা আঞ্চলিক বিভাজন নির্দেশ করত।"
    },
    "distribution": {
      "title": "বাই জিয়া শিং এবং ভৌগলিক বিতরণ",
      "ranking": "পদবি র‍্যাঙ্কিং",
      "ranking_desc": "বর্তমানে চীনে সবচেয়ে সাধারণ পদবিগুলি হল লি, ওয়াং, ঝাং, লিউ, চেন ইত্যাদি। এই পদবিগুলির বিতরণ চীনের ইতিহাসে জনসংখ্যা স্থানান্তর এবং সাংস্কৃতিক মিশ্রণের প্রক্রিয়া প্রতিফলিত করে।",
      "regional": "আঞ্চলিক বৈশিষ্ট্য",
      "regional_desc": "দক্ষিণাঞ্চলের সাধারণ পদবিগুলি উত্তরাঞ্চলের থেকে আলাদা, যা ঐতিহাসিক অভিবাসন তরঙ্গ, ভূগোল এবং সাংস্কৃতিক ঐতিহ্যের সাথে ঘনিষ্ঠভাবে সম্পর্কিত।"
    },
    "navigation": {
      "title": "দ্রুত পরিভ্রমণ",
      "origin": "পদবির উৎপত্তি",
      "distribution": "ভৌগলিক বিতরণ",
      "culture": "পদবি সংস্কৃতি"
    }
  },
  "surnames": {
    "li": {
      "origin": "লি পদবি বো ই-এর বংশধর থেকে উদ্ভূত, যারা 'লি' অফিসিয়াল পদবি ধারণ করেছিলেন। অন্য মতে এটি ইয়ান এম্পারার শেননং-এর বংশধর থেকেও এসেছে।",
      "history": "লি চীনের সবচেয়ে বড় পদবি, ঐতিহাসিকভাবে সবচেয়ে বিখ্যাত লি শাসনকাল ছিল ট্যাং রাজবংশ, যা লি ইউয়ান প্রতিষ্ঠা করেছিলেন। লি পদবি বসন্ত ও শরৎকালীন যুদ্ধের সময় থেকেই খুব সাধারণ ছিল।",
      "distribution": "সারা দেশে ছড়িয়ে আছে, বিশেষ করে শানশি এবং গানসু অঞ্চলে বেশি কেন্দ্রীভূত",
      "famous_people": "লি বাই (কবি), লি চিং ঝাও (কবি), লি শাং ইন (কবি), লি শি মিন (সম্রাট)"
    },
    "wang": {
      "origin": "প্রাচীন কাল থেকে উদ্ভূত, এটি প্রাচীনতম পদবিগুলির মধ্যে একটি। ঐতিহ্যগতভাবে ওয়াং হাই-এর বংশধরদের দ্বারা ব্যবহৃত হত।",
      "history": "ওয়াং চীনের দ্বিতীয় বৃহত্তম পদবি, বসন্তকালে এটি ইতিমধ্যেই একটি বড় পদবি ছিল। ঐতিহাসিকভাবে বলা হয় যে 'পৃথিবীতে ওয়াং পদবি, ১৮০,০০০ পরিবার'।",
      "distribution": "সারা দেশে ব্যাপকভাবে ছড়িয়ে আছে, শানডং এবং হেবেই অঞ্চলে বেশি কেন্দ্রীভূত",
      "famous_people": "ওয়াং শি ঝি (ক্যালিগ্রাফার), ওয়াং ওয়েই (কবি), ওয়াং আন শি (রাজনীতিবিদ), ওয়াং ইয়াং মিং (দার্শনিক)"
    },
    "zhang": {
      "origin": "প্রাচীন কাল থেকে উদ্ভূত, ঐতিহ্যগতভাবে হলুদ সম্রাটের সময়কার ধনুক ও তীরের আবিষ্কারক ঝাং হু-এর বংশধর।",
      "history": "ঝাং চীনের তৃতীয় বৃহত্তম পদবি, বসন্ত ও শরৎকালীন যুদ্ধের সময় থেকেই খুব সমৃদ্ধ ছিল। হান যুগে ঝাং লিয়াং লিউ বাং-কে হান রাজবংশ প্রতিষ্ঠায় সাহায্য করে ঝাং পদবিকে আরও বিখ্যাত করেন।",
      "distribution": "সারা দেশে ব্যাপকভাবে ছড়িয়ে আছে, হেনান এবং শানডং অঞ্চলে বেশি কেন্দ্রীভূত",
      "famous_people": "ঝাং লিয়াং (রাজনীতিবিদ), ঝাং ফেই (সেনাপতি), ঝাং জে দুয়ান (চিত্রশিল্পী), ঝাং হেং (বিজ্ঞানী)"
    },
    "liu": {
      "origin": "জি পদবি থেকে উদ্ভূত, ঐতিহ্যগতভাবে হলুদ সম্রাটের বংশধর। লিউ লেই ড্রাগন ঘোড়া প্রশিক্ষণে দক্ষ ছিলেন বলে লিউ পদবি পেয়েছিলেন।",
      "history": "লিউ চীনের চতুর্থ বৃহত্তম পদবি, ঐতিহাসিকভাবে সবচেয়ে বিখ্যাত লিউ শাসনকাল ছিল হান রাজবংশ, যা লিউ বাং প্রতিষ্ঠা করেছিলেন এবং ৪০০ বছরেরও বেশি স্থায়ী হয়েছিল।",
      "distribution": "সারা দেশে ব্যাপকভাবে ছড়িয়ে আছে, হেনান, শানডং এবং আনহুই অঞ্চলে বেশি কেন্দ্রীভূত",
      "famous_people": "লিউ বাং (সম্রাট), লিউ বেই (সম্রাট), লিউ ইউ শি (সাহিত্যিক), লিউ শাও চি (রাজনীতিবিদ)"
    },
    "chen": {
      "origin": "গুই পদবি থেকে উদ্ভূত, ঐতিহ্যগতভাবে সম্রাট শুন-এর বংশধর। চেন (বর্তমান হেনান হুয়াইয়াং) এলাকায় শাসন করার কারণে এই পদবি পেয়েছিলেন।",
      "history": "চেন চীনের পঞ্চম বৃহত্তম পদবি, বসন্তকালে চেন রাজ্য প্রতিষ্ঠা করেছিল। দক্ষিণ রাজবংশের সময়ে চেন রাজবংশও ছিল।",
      "distribution": "সারা দেশে ব্যাপকভাবে ছড়িয়ে আছে, ফুজিয়ান, গুয়াংডং এবং ঝেজিয়াং অঞ্চলে বেশি কেন্দ্রীভূত",
      "famous_people": "চেন শেং (বিদ্রোহী নেতা), চেন শোউ (ঐতিহাসিক), চেন জি আং (কবি), চেন দু শিউ (শিক্ষাবিদ)"
    },
    "yang": {
      "origin": "জি পদবি থেকে উদ্ভূত, ঐতিহ্যগতভাবে ঝোউ রাজা ওয়েন-এর নবম পুত্র শু লিয়াং হে-এর বংশধর। ইয়াং শহরে শাসন করার কারণে এই পদবি পেয়েছিলেন।",
      "history": "ইয়াং পদবি বসন্ত ও শরৎকালীন যুদ্ধের সময় থেকেই খুব সাধারণ ছিল, সুই রাজবংশের প্রতিষ্ঠাতা সম্রাট ইয়াং জিয়ান ইয়াং পদবিকে আরও বিখ্যাত করেন।",
      "distribution": "সারা দেশে ব্যাপকভাবে ছড়িয়ে আছে, শানশি এবং সিচুয়ান অঞ্চলে বেশি কেন্দ্রীভূত",
      "famous_people": "ইয়াং জিয়ান (সম্রাট), ইয়াং গুই ফেই (রাজ্ঞী), ইয়াং ইয়ান ঝাও (সেনাপতি), ইয়াং জিয়াং (লেখক)"
    },
    "zhao": {
      "origin": "ইিং পদবি থেকে উদ্ভূত, ঐতিহ্যগতভাবে ঝাও ফু-এর বংশধর। ঝাও শহরে (বর্তমান শানশি হংডং) শাসন করার কারণে এই পদবি পেয়েছিলেন।",
      "history": "ঝাও চীনের একটি ঐতিহাসিক পদবি, যুদ্ধরত রাজ্যের সময়ে ঝাও রাজ্য ঝাও পরিবার দ্বারা প্রতিষ্ঠিত হয়েছিল।",
      "distribution": "সারা দেশে ব্যাপকভাবে ছড়িয়ে আছে, শানশি এবং হেবেই অঞ্চলে বেশি কেন্দ্রীভূত",
      "famous_people": "ঝাও উ লিং ওয়াং (রাজা), ঝাও কুয়াং ইিন (সম্রাট), ঝাও ইউন (সেনাপতি), ঝাও মেং ফু (চিত্রশিল্পী)"
    },
    "sun": {
      "origin": "জি পদবি থেকে উদ্ভূত, ঐতিহ্যগতভাবে ঝোউ রাজা ওয়েন-এর পুত্র সান শু দু-এর বংশধর।",
      "history": "সান পদবি বসন্ত ও শরৎকালীন যুদ্ধের সময় থেকেই খুব সাধারণ ছিল, তিন রাজ্যের সময়ে সান কুয়ান উ রাজ্য প্রতিষ্ঠা করেন।",
      "distribution": "সারা দেশে ব্যাপকভাবে ছড়িয়ে আছে, শানডং এবং জিয়াংসু অঞ্চলে বেশি কেন্দ্রীভূত",
      "famous_people": "সান উ (সামরিক কৌশলবিদ), সান কুয়ান (সম্রাট), সান ইয়াৎ-সেন (বিপ্লবী নেতা), সান সি মিয়াও (চিকিৎসক)"
    },
    "zhou": {
      "origin": "জি পদবি থেকে উদ্ভূত, ঐতিহ্যগতভাবে ঝোউ রাজা ওয়েন জি চাং-এর বংশধর।",
      "history": "ঝোউ চীনের প্রাচীনতম পদবিগুলির মধ্যে একটি, ঝোউ রাজবংশের শাসকরা ঝোউ পদবির ছিলেন।",
      "distribution": "সারা দেশে ব্যাপকভাবে ছড়িয়ে আছে, হুনান এবং জিয়াংশি অঞ্চলে বেশি কেন্দ্রীভূত",
      "famous_people": "ঝোউ গং দান (রাজনীতিবিদ), ঝোউ দুন ই (দার্শনিক), ঝোউ এন লাই (প্রধানমন্ত্রী), ঝোউ শু রেন (লেখক)"
    },
    "wu": {
      "origin": "জি পদবি থেকে উদ্ভূত, ঐতিহ্যগতভাবে ঝোউ রাজা উ জি ফা-এর বংশধর। উ (বর্তমান জিয়াংসু সুঝোউ) এলাকায় শাসন করার কারণে এই পদবি পেয়েছিলেন।",
      "history": "উ পদবি বসন্তকালে খুব সাধারণ ছিল, ইতিহাসে উ রাজ্যসহ বিভিন্ন রাজ্য ছিল।",
      "distribution": "সারা দেশে ব্যাপকভাবে ছড়িয়ে আছে, জিয়াংসু এবং ঝেজিয়াং অঞ্চলে বেশি কেন্দ্রীভূত",
      "famous_people": "উ চি (সেনাপতি), উ দাও জি (চিত্রশিল্পী), উ চেং এন (লেখক), উ জিং জি (লেখক)"
    }
  }
}
