{
  "common": {
    "language": "English",
    "title": "CC Name - Name Recommendation System Based on Chinese Culture",
    "description": "A name recommendation system based on ancient Chinese poetry, classics, and principles of Wu Xing and Yi Jing",
    "not_found": "Page Not Found",
    "path_not_exists": "The path you are trying to access does not exist",
    "page_moved": "This page may have been moved or deleted",
    "back_home": "Return to Home Page"
  },
  "header": {
    "home": "Home",
    "surnameculture": "Surname Culture",
    "about": "About",
    "login": "Login"
  },
  "home": {
    "slogan": "Traditional Wisdom · Modern Names",
    "description": "Combining the essence of traditional culture from 'Shijing' and 'Four Books and Five Classics' with the profound wisdom of Wu Xing and Yi Jing to create a unique name chart for you.",
    "wuxing": "Five Elements",
    "wuxing_desc": "Based on your date and time of birth, precisely matching the Five Elements attributes to ensure your name harmonizes with your destiny",
    "shijing": "Poetic References",
    "shijing_desc": "Drawing inspiration from the Book of Odes, incorporating classical culture to infuse your name with deep cultural meaning",
    "wuxing_tooltip": "The Five Elements (Metal, Wood, Water, Fire, Earth) are an important theory in ancient Chinese philosophy that explains the composition of the natural world and its laws of movement and change. This theory holds that everything in the world is composed of the Five Elements, which mutually promote and restrain each other: Wood promotes Fire, Fire promotes Earth, Earth promotes Metal, Metal promotes Water, and Water promotes Wood. In naming, the principle of mutual promotion and restraint of the Five Elements can help balance one's destiny and bring good fortune while avoiding misfortune.",
    "shijing_tooltip": "The 'Shijing' (Book of Odes) is the oldest collection of poetry in China, containing 311 poems from the early Western Zhou Dynasty to the middle of the Spring and Autumn Period (11th to 6th centuries BCE). It contains rich cultural connotations, beautiful imagery, and profound human spirit. In naming, drawing inspiration from the allusions and imagery in the 'Shijing' not only gives names a far-reaching cultural foundation but also continues the essence of Chinese culture."
  },
  "form": {
    "title": "Find Your Destined Name",
    "birthdate": "Date of Birth",
    "birthdate_placeholder": "Select your date of birth",
    "birthdate_required": "Please provide a date of birth",
    "birthdate_invalid": "Please provide a valid date of birth",
    "birthtime": "Time of Birth",
    "gender": "Gender",
    "male": "Male",
    "female": "Female",
    "neutral": "Neutral",
    "surname": "Surname",
    "surname_placeholder": "Enter your surname (optional)",
    "surname_error": "Please enter 1-2 Chinese characters",
    "date_error": "Please use the correct date format: yyyy/MM/dd",
    "submit": "Generate Name Recommendations",
    "loading": "Generating...",
    "generation_error": "Error generating names, please try again",
    "form_title": "Fill in Basic Information",
    "time_range": "Birth Time Range",
    "time_range_morning": "Morning (Zi Hour - Mao Hour)",
    "time_range_afternoon": "Afternoon (Chen Hour - Wei Hour)",
    "time_range_evening": "Evening (Shen Hour - Xu Hour)",
    "time_range_night": "Night (Hai Hour - Chou Hour)",
    "timezones": {
      "zi": "Zi Hour (0:00-2:00)",
      "chou": "Chou Hour (2:00-4:00)",
      "yin": "Yin Hour (4:00-6:00)",
      "mao": "Mao Hour (6:00-8:00)",
      "chen": "Chen Hour (8:00-10:00)",
      "si": "Si Hour (10:00-12:00)",
      "wu": "Wu Hour (12:00-14:00)",
      "wei": "Wei Hour (14:00-16:00)",
      "shen": "Shen Hour (16:00-18:00)",
      "you": "You Hour (18:00-20:00)",
      "xu": "Xu Hour (20:00-22:00)",
      "hai": "Hai Hour (22:00-24:00)"
    }
  },
  "result": {
    "title": "Your Name Analysis",
    "introduction": "Based on your birth information, we have generated the following name recommendations for you:",
    "name_recommendation": "Recommended Names",
    "five_elements": "Five Elements Analysis",
    "poetic_reference": "Poetic Reference",
    "name_meaning": "Name Meaning",
    "name_score": "Name Score",
    "compatibility": "Compatibility with Birth Chart",
    "cultural_depth": "Cultural Depth",
    "uniqueness": "Uniqueness",
    "pronunciation": "Phonetic Aesthetics",
    "try_again": "Generate Again",
    "back_to_home": "Back to Home"
  },
  "footer": {
    "copyright": "© 2025 CC Name. All rights reserved.",
    "privacy": "Privacy Policy",
    "terms": "Terms of Use",
    "contact": "Contact Us"
  },
  "feedback": {
    "title": "User Feedback",
    "anonymous": "Anonymous User",
    "name_label": "Your Name (optional)",
    "email_label": "Email (optional)",
    "message_label": "Feedback Content",
    "submit": "Submit Feedback",
    "submitting": "Submitting...",
    "thank_you": "Thank you for your feedback! We will carefully review your suggestions.",
    "continue": "Continue Feedback",
    "error_message": "Error submitting, please try again later or contact us through other means.",
    "timeout_message": "Submission timed out, please check your network connection and try again."
  },
  "about": {
    "title": "About Us",
    "intro": {
      "p1": "We are a team dedicated to the inheritance of traditional Chinese culture, focused on providing cultural heritage name recommendation services.",
      "p2": "Combining traditional naming principles and modern data analysis, we offer unique and meaningful name options for every family."
    },
    "philosophy": {
      "title": "Our Philosophy",
      "item1": "Respect tradition, inherit culture",
      "item2": "Scientific analysis, accurate recommendations",
      "item3": "Professional service, meticulous care"
    },
    "advantages": {
      "title": "Our Advantages",
      "team": {
        "title": "Professional Team",
        "description": "A professional team with years of naming experience, deeply versed in the essence of traditional culture"
      },
      "method": {
        "title": "Scientific Method",
        "description": "Combining traditional culture with modern analytical methods to provide you with the best recommendations"
      }
    },
    "contact": {
      "intro": "If you have any questions or suggestions, please feel free to contact us",
      "email": {
        "title": "Email"
      }
    }
  },
  "surname": {
    "title": "Chinese Surname Culture",
    "subtitle": "Explore five thousand years of surname origins, inherit the imprint of Chinese civilization",
    "banner": {
      "alt": "History of the Hundred Family Names"
    },
    "wiki_link": "Explore more surname origins",
    "origin": {
      "title": "Origin and Evolution of Surnames",
      "description": "Chinese surname culture has a long history dating back to antiquity. Initially, there was a distinction between 'xing' (姓) and 'shi' (氏): 'xing' represented blood relations, while 'shi' indicated social status or territorial division."
    },
    "distribution": {
      "title": "Hundred Family Names and Regional Distribution",
      "ranking": "Surname Rankings",
      "ranking_desc": "The most common surnames in China currently are Li, Wang, Zhang, Liu, Chen, etc. The distribution and migration of these surnames reflect population movement and cultural integration throughout Chinese history.",
      "regional": "Regional Characteristics",
      "regional_desc": "Common surnames in southern regions differ from those in the north, which is closely related to historical migration waves, geographical environment, and cultural traditions."
    },
    "navigation": {
      "title": "Quick Navigation",
      "origin": "Origin of Names",
      "distribution": "Regional Distribution",
      "culture": "Name Culture"
    }
  },
  "surnames": {
    "li": {
      "origin": "The Li surname originated from the ancestral surname Ying, tracing back to Emperor Zhuanxu of antiquity. The first ancestor was Li Lizhen, a minister of the Shang Dynasty.",
      "history": "Li is the largest surname in China, with the most famous Li regime being the Tang Dynasty, established by Li Yuan. The Li surname was already common during the Spring and Autumn Period.",
      "distribution": "Distributed throughout the country, with particularly high concentrations in Shaanxi and Gansu provinces",
      "famous_people": "Li Bai (poet), Li Qingzhao (poet), Li Shangyin (poet), Li Shimin (Emperor Taizong of Tang)"
    },
    "wang": {
      "origin": "Originated from ancient times, being one of the earliest surnames. Traditionally used by the descendants of Wang Hai.",
      "history": "Wang is the second largest surname in China, already being a major surname during the Spring Period. Historically, it was said that 'Wang surnames in the world, 180,000 households.'",
      "distribution": "Widely distributed throughout the country, with higher concentrations in Shandong and Hebei provinces",
      "famous_people": "Wang Xizhi (calligrapher), Wang Wei (poet), Wang Anshi (statesman), Wang Yangming (philosopher)"
    },
    "zhang": {
      "origin": "Originated from ancient times, traditionally descended from Zhang Hu, the inventor of bow and arrow during the Yellow Emperor's time.",
      "history": "Zhang is the third largest surname in China, already prosperous during the Spring and Autumn Period. During the Han Dynasty, Zhang Liang helped Liu Bang establish the Han Dynasty, making the Zhang surname even more prominent.",
      "distribution": "Widely distributed throughout the country, with higher concentrations in Henan and Shandong provinces",
      "famous_people": "Zhang Liang (statesman), Zhang Fei (general), Zhang Zeduan (painter), Zhang Heng (scientist)"
    },
    "liu": {
      "origin": "Originated from the Ji surname, traditionally descended from the Yellow Emperor. Liu Lei received the surname for his skill in training dragon horses.",
      "history": "Liu is the fourth largest surname in China, with the most prominent Liu regime being the Han Dynasty, established by Liu Bang and lasting over 400 years.",
      "distribution": "Widely distributed throughout the country, with higher concentrations in Henan, Shandong, and Anhui provinces",
      "famous_people": "Liu Bang (Emperor Gaozu of Han), Liu Bei (Emperor of Shu Han), Liu Yuxi (writer), Liu Shaoqi (statesman)"
    },
    "chen": {
      "origin": "Originated from the Gui surname, traditionally descended from Emperor Shun. Received the surname due to their fief in Chen (present-day Huaiyang, Henan).",
      "history": "Chen is the fifth largest surname in China, establishing the state of Chen during the Spring Period. The Chen Dynasty also appeared during the Southern Dynasties period.",
      "distribution": "Widely distributed throughout the country, with higher concentrations in Fujian, Guangdong, and Zhejiang provinces",
      "famous_people": "Chen Sheng (rebel leader), Chen Shou (historian), Chen Zi'ang (poet), Chen Duxiu (educator)"
    },
    "yang": {
      "origin": "Originated from the Ji surname, traditionally descended from Shu Liang He, the ninth son of King Wen of Zhou. Received the surname due to their fief in Yang city.",
      "history": "Yang surname was already common during the Spring and Autumn Period, with Emperor Yang Jian, founder of the Sui Dynasty, making the Yang surname more prominent.",
      "distribution": "Widely distributed throughout the country, with higher concentrations in Shaanxi and Sichuan provinces",
      "famous_people": "Yang Jian (Emperor Wen of Sui), Yang Guifei (imperial consort), Yang Yanzhao (general), Yang Jiang (writer)"
    },
    "zhao": {
      "origin": "Originated from the Ying surname, traditionally descended from Zhao Fu. Received the surname due to their fief in Zhao city (present-day Hongdong, Shanxi).",
      "history": "Zhao is a historic surname in China, with the State of Zhao during the Warring States Period being established by the Zhao family.",
      "distribution": "Widely distributed throughout the country, with higher concentrations in Shanxi and Hebei provinces",
      "famous_people": "Zhao Wuling Wang (king), Zhao Kuangyin (Emperor Taizu of Song), Zhao Yun (general), Zhao Mengfu (painter)"
    },
    "sun": {
      "origin": "Originated from the Ji surname, traditionally descended from Sun Shuduo, son of King Wen of Zhou.",
      "history": "Sun surname was already common during the Spring and Autumn Period, with Sun Quan establishing the Wu regime during the Three Kingdoms period.",
      "distribution": "Widely distributed throughout the country, with higher concentrations in Shandong and Jiangsu provinces",
      "famous_people": "Sun Wu (military strategist), Sun Quan (Emperor of Wu), Sun Yat-sen (revolutionary leader), Sun Simiao (physician)"
    },
    "zhou": {
      "origin": "Originated from the Ji surname, traditionally descended from Ji Chang (King Wen of Zhou).",
      "history": "Zhou is one of the oldest surnames in China, with the rulers of the Zhou Dynasty bearing this surname.",
      "distribution": "Widely distributed throughout the country, with higher concentrations in Hunan and Jiangxi provinces",
      "famous_people": "Zhou Gong Dan (statesman), Zhou Dunyi (philosopher), Zhou Enlai (premier), Zhou Shuren (writer)"
    },
    "wu": {
      "origin": "Originated from the Ji surname, traditionally descended from Ji Fa (King Wu of Zhou). Received the surname due to their fief in Wu (present-day Suzhou, Jiangsu).",
      "history": "Wu surname was already common during the Spring Period, with various states including the State of Wu in history.",
      "distribution": "Widely distributed throughout the country, with higher concentrations in Jiangsu and Zhejiang provinces",
      "famous_people": "Wu Qi (general), Wu Daozi (painter), Wu Cheng'en (writer), Wu Jingzi (writer)"
    }
  }
}
