{
  "common": {
    "language": "Español",
    "title": "CC Name - Sistema de recomendación de nombres basado en la cultura china",
    "description": "Un sistema de recomendación de nombres basado en la poesía china antigua, los clásicos y los principios de Wu Xing y Yi Jing",
    "not_found": "Página no encontrada",
    "path_not_exists": "La ruta a la que intenta acceder no existe",
    "page_moved": "Es posible que esta página haya sido movida o eliminada",
    "back_home": "Volver al inicio",
    "data_not_found": "Parámetro de datos no encontrado",
    "url_decode_error": "Error en la decodificación de URL: formato de datos inválido",
    "json_parse_error": "Error en el análisis JSON: formato de datos inválido",
    "data_processing_error": "Se produjo un error durante el procesamiento de datos",
    "general_error": "Ocurrió un error. Por favor, inténtelo de nuevo más tarde.",
    "data_source_description": "El método principal utiliza una tabla de búsqueda para la conversión, con datos de",
    "hko_calendar_conversion": "Observatorio de Hong Kong [Conversión entre Calendario Solar y Lunar]"
  },
  "header": {
    "home": "Inicio",
    "surnameculture": "Cultura de apellidos",
    "about": "Acerca de",
    "login": "Iniciar sesión"
  },
  "home": {
    "slogan": "Sabiduría tradicional · Nombres modernos",
    "description": "Combinando la esencia de la cultura tradicional del 'Shijing' y los 'Cuatro Libros y Cinco Clásicos' con la profunda sabiduría del Wu Xing y Yi Jing para crear una tarjeta de nombre personal única para ti.",
    "wuxing": "Cinco Elementos",
    "wuxing_desc": "Basado en tu fecha y hora de nacimiento, coincidiendo precisamente con los atributos de los Cinco Elementos para asegurar que tu nombre armonice con tu destino",
    "shijing": "Referencias poéticas",
    "shijing_desc": "Inspirándose en el Libro de las Odas, incorporando la cultura clásica para infundir a tu nombre un profundo significado cultural",
    "wuxing_tooltip": "Los Cinco Elementos (Metal, Madera, Agua, Fuego, Tierra) son una teoría importante en la filosofía china antigua que explica la composición del mundo natural y sus leyes de movimiento y cambio. Esta teoría sostiene que todo en el mundo está compuesto por los Cinco Elementos, que se promueven y restringen mutuamente: la Madera promueve el Fuego, el Fuego promueve la Tierra, la Tierra promueve el Metal, el Metal promueve el Agua, y el Agua promueve la Madera. En la nominación, el principio de promoción y restricción mutua de los Cinco Elementos puede ayudar a equilibrar el destino de uno y traer buena fortuna mientras se evita la desgracia.",
    "shijing_tooltip": "El 'Shijing' (Libro de las Odas) es la colección de poesía más antigua de China, que contiene 311 poemas desde principios de la dinastía Zhou occidental hasta mediados del período de Primavera y Otoño (siglos XI a VI a.C.). Contiene ricas connotaciones culturales, hermosas imágenes y un profundo espíritu humano. Al nombrar, inspirarse en las alusiones e imágenes del 'Shijing' no solo da a los nombres una base cultural de largo alcance, sino que también continúa la esencia de la cultura china.",
    "hover_for_details": "Pasa el cursor para ver información detallada",
    "shijing_quote": "Guan-guan cantan los ospreys, en el islote del río. La doncella modesta, recatada y virtuosa: para nuestro príncipe, una buena compañera.",
    "shijing_source": "Libro de las Odas, Guanju",
    "classics_in_naming": "Aplicación de la cultura clásica en la nominación",
    "classics_point1": "Extrayendo bellas imágenes de clásicos como Shijing y Chuci",
    "classics_point2": "Incorporando el contexto cultural tradicional para dar a los nombres un significado profundo",
    "classics_point3": "Heredando la esencia de la civilización china, conectando la cultura antigua y moderna",
    "shijing_naming": "Un buen nombre no es solo una combinación de caracteres, sino la herencia e innovación de la cultura tradicional.",
    "wuxing_naming": "Aplicación de los Cinco Elementos en la nominación: seleccionando caracteres con atributos correspondientes basados en la deficiencia en la carta natal para lograr el equilibrio.",
    "metal_desc": "Fuerte y resuelto, simbolizando la decisión y el otoño",
    "wood_desc": "Creciente y flexible, simbolizando la innovación y la primavera",
    "water_desc": "Fluido y sabio, simbolizando la adaptabilidad y el invierno",
    "fire_desc": "Apasionado y enérgico, simbolizando el cambio y el verano",
    "earth_desc": "Estable e inclusivo, simbolizando la armonía y las estaciones tardías",
    "intro_title": "Explorando la filosofía tradicional china de nombrar"
  },
  "form": {
    "title": "Encuentra tu nombre destinado",
    "birthdate": "Fecha de nacimiento",
    "birthdate_placeholder": "Selecciona tu fecha de nacimiento",
    "birthdate_required": "Por favor proporciona tu fecha de nacimiento",
    "birthdate_invalid": "Por favor proporciona una fecha de nacimiento válida",
    "birthtime": "Hora de nacimiento",
    "gender": "Género",
    "male": "Masculino",
    "female": "Femenino",
    "neutral": "Neutral",
    "surname": "Apellido",
    "surname_placeholder": "Ingresa tu apellido (opcional)",
    "surname_error": "Por favor ingresa 1-2 caracteres chinos",
    "date_error": "Por favor usa el formato de fecha correcto: yyyy/MM/dd",
    "submit": "Generar recomendaciones de nombres",
    "loading": "Generando...",
    "generation_error": "Error al generar nombres, por favor intenta de nuevo",
    "form_title": "Completa la información básica",
    "time_range": "Rango de tiempo de nacimiento",
    "time_range_morning": "Mañana (Hora Zi - Hora Mao)",
    "time_range_afternoon": "Tarde (Hora Chen - Hora Wei)",
    "time_range_evening": "Noche (Hora Shen - Hora Xu)",
    "time_range_night": "Madrugada (Hora Hai - Hora Chou)",
    "network_timeout_error": "Tiempo de espera de solicitud de red agotado, verifique su conexión e intente nuevamente",
    "try_again": "Intentar de nuevo",
    "name_generating": "Estamos trabajando arduamente para generar recomendaciones de nombres personalizadas para usted, por favor espere...",
    "almost_done": "Casi terminado, un momento más...",
    "timezones": {
      "zi": "Hora Zi (0:00-2:00)",
      "chou": "Hora Chou (2:00-4:00)",
      "yin": "Hora Yin (4:00-6:00)",
      "mao": "Hora Mao (6:00-8:00)",
      "chen": "Hora Chen (8:00-10:00)",
      "si": "Hora Si (10:00-12:00)",
      "wu": "Hora Wu (12:00-14:00)",
      "wei": "Hora Wei (14:00-16:00)",
      "shen": "Hora Shen (16:00-18:00)",
      "you": "Hora You (18:00-20:00)",
      "xu": "Hora Xu (20:00-22:00)",
      "hai": "Hora Hai (22:00-24:00)"
    }
  },
  "result": {
    "title": "Análisis de su nombre",
    "introduction": "Basado en su información de nacimiento, hemos generado las siguientes recomendaciones de nombres para usted:",
    "name_recommendation": "Nombres recomendados",
    "five_elements": "Análisis de los cinco elementos",
    "poetic_reference": "Referencia poética",
    "name_meaning": "Significado del nombre",
    "name_score": "Puntuación del nombre",
    "compatibility": "Compatibilidad con la carta natal",
    "cultural_depth": "Profundidad cultural",
    "uniqueness": "Singularidad",
    "pronunciation": "Estética de pronunciación",
    "back_to_home": "Volver al inicio",
    "name_analysis": "Razonamiento de los cinco elementos",
    "language_notice": "La selección de idioma está desactivada en esta página. Por favor, vuelva a la página de inicio si desea cambiar el idioma.",
    "elements": {
      "metal": "Metal",
      "wood": "Madera",
      "water": "Agua",
      "fire": "Fuego",
      "earth": "Tierra"
    }
  },
  "footer": {
    "copyright": "© 2025 CC Name. Todos los derechos reservados.",
    "privacy": "Política de privacidad",
    "terms": "Términos de uso",
    "contact": "Contáctanos"
  },
  "feedback": {
    "title": "Comentarios de Usuarios",
    "anonymous": "Usuario Anónimo",
    "name_label": "Tu Nombre (opcional)",
    "email_label": "Correo Electrónico (opcional)",
    "message_label": "Contenido del Comentario",
    "submit": "Enviar Comentario",
    "submitting": "Enviando...",
    "thank_you": "¡Gracias por tu comentario! Consideraremos cuidadosamente tus sugerencias.",
    "continue": "Continuar Comentario",
    "error_message": "Error al enviar, por favor intenta de nuevo más tarde o contáctanos por otros medios.",
    "timeout_message": "Tiempo de envío agotado, por favor verifica tu conexión de red e intenta de nuevo."
  },
  "about": {
    "title": "Acerca de Nosotros",
    "intro": {
      "p1": "Somos un equipo dedicado a la herencia de la cultura tradicional china, enfocados en proporcionar servicios de recomendación de nombres con patrimonio cultural.",
      "p2": "Combinando principios tradicionales de nomenclatura y análisis de datos modernos, ofrecemos opciones de nombres únicos y significativos para cada familia."
    },
    "philosophy": {
      "title": "Nuestra Filosofía",
      "item1": "Respetar la tradición, heredar la cultura",
      "item2": "Análisis científico, recomendaciones precisas",
      "item3": "Servicio profesional, atención cuidadosa"
    },
    "advantages": {
      "title": "Nuestras Ventajas",
      "team": {
        "title": "Equipo Profesional",
        "description": "Un equipo profesional con años de experiencia en nomenclatura, profundamente versado en la esencia de la cultura tradicional"
      },
      "method": {
        "title": "Método Científico",
        "description": "Combinando la cultura tradicional con métodos analíticos modernos para proporcionarte las mejores recomendaciones"
      }
    },
    "contact": {
      "intro": "Si tienes alguna pregunta o sugerencia, no dudes en contactarnos",
      "email": {
        "title": "Correo Electrónico"
      }
    }
  },
  "surname": {
    "title": "Cultura de Apellidos Chinos",
    "subtitle": "Explora cinco mil años de orígenes de apellidos, hereda la huella de la civilización china",
    "banner": {
      "alt": "Historia de los Cien Apellidos"
    },
    "wiki_link": "Explora más orígenes de apellidos",
    "origin": {
      "title": "Origen y Evolución de los Apellidos",
      "description": "La cultura de apellidos chinos tiene una larga historia que se remonta a tiempos antiguos. Inicialmente, había una distinción entre 'xing' (姓) y 'shi' (氏): 'xing' representaba relaciones de sangre, mientras que 'shi' indicaba estatus social o división territorial."
    },
    "distribution": {
      "title": "Cien Apellidos y Distribución Regional",
      "ranking": "Clasificación de Apellidos",
      "ranking_desc": "Los apellidos más comunes en China actualmente son Li, Wang, Zhang, Liu, Chen, etc. La distribución y migración de estos apellidos refleja el movimiento de población y la integración cultural a lo largo de la historia china.",
      "regional": "Características Regionales",
      "regional_desc": "Los apellidos comunes en las regiones del sur difieren de los del norte, lo cual está estrechamente relacionado con las olas migratorias históricas, el entorno geográfico y las tradiciones culturales."
    },
    "navigation": {
      "title": "Navegación Rápida",
      "origin": "Origen de Apellidos",
      "distribution": "Distribución Regional",
      "culture": "Cultura de Apellidos"
    }
  },
  "surnames": {
    "li": {
      "origin": "El apellido Li se originó del apellido ancestral Ying, que se remonta al emperador Zhuanxu de la antigüedad. El primer antepasado fue Li Lizhen, un ministro de la dinastía Shang.",
      "history": "El apellido Li es uno de los apellidos más antiguos de China, con una historia de más de 3,000 años. Durante la dinastía Tang, el apellido Li se convirtió en el apellido real, lo que llevó a su gran desarrollo.",
      "distribution": "El apellido Li está ampliamente distribuido en todo el país, con una concentración particularmente alta en las provincias de Henan, Shandong, Sichuan y Guangdong.",
      "famous_people": "Li Bai (poeta de la dinastía Tang), Li Shimin (emperador Taizong de Tang), Li Shizhen (médico de la dinastía Ming)"
    },
    "wang": {
      "origin": "El apellido Wang se originó del apellido ancestral Ji, que se remonta al rey Wen de Zhou. El primer antepasado fue Wang Jian, un ministro de la dinastía Zhou.",
      "history": "El apellido Wang es uno de los apellidos más grandes de China, con una historia de más de 2,800 años. Durante las dinastías Han y Tang, el apellido Wang produjo muchas figuras prominentes.",
      "distribution": "El apellido Wang está ampliamente distribuido en todo el país, con una concentración particularmente alta en las provincias de Shandong, Henan, Hebei y Jiangsu.",
      "famous_people": "Wang Xizhi (calígrafo de la dinastía Jin), Wang Anshi (estadista de la dinastía Song), Wang Yangming (filósofo de la dinastía Ming)"
    },
    "zhang": {
      "origin": "El apellido Zhang se originó del apellido ancestral Ji, que se remonta al rey Wen de Zhou. El primer antepasado fue Zhang Hui, un ministro de la dinastía Zhou.",
      "history": "El apellido Zhang es uno de los apellidos más grandes de China, con una historia de más de 2,800 años. Durante las dinastías Han y Tang, el apellido Zhang produjo muchas figuras prominentes.",
      "distribution": "El apellido Zhang está ampliamente distribuido en todo el país, con una concentración particularmente alta en las provincias de Henan, Shandong, Hebei y Jiangsu.",
      "famous_people": "Zhang Liang (estadista de la dinastía Han), Zhang Heng (científico de la dinastía Han), Zhang Zhongjing (médico de la dinastía Han)"
    },
    "liu": {
      "origin": "El apellido Liu se originó del apellido ancestral Ji, que se remonta al rey Wen de Zhou. El primer antepasado fue Liu Bang, fundador de la dinastía Han.",
      "history": "El apellido Liu es uno de los apellidos más grandes de China, con una historia de más de 2,200 años. Durante la dinastía Han, el apellido Liu se convirtió en el apellido real, lo que llevó a su gran desarrollo.",
      "distribution": "El apellido Liu está ampliamente distribuido en todo el país, con una concentración particularmente alta en las provincias de Henan, Shandong, Hebei y Jiangsu.",
      "famous_people": "Liu Bang (emperador Gaozu de Han), Liu Bei (emperador de Shu Han), Liu Zongyuan (escritor de la dinastía Tang)"
    },
    "chen": {
      "origin": "El apellido Chen se originó del apellido ancestral Gui, que se remonta al emperador Shun de la antigüedad. El primer antepasado fue Chen Hu Gong, un ministro de la dinastía Zhou.",
      "history": "El apellido Chen es uno de los apellidos más grandes de China, con una historia de más de 3,000 años. Durante las dinastías Han y Tang, el apellido Chen produjo muchas figuras prominentes.",
      "distribution": "El apellido Chen está ampliamente distribuido en todo el país, con una concentración particularmente alta en las provincias de Guangdong, Fujian, Zhejiang y Jiangsu.",
      "famous_people": "Chen Sheng (líder rebelde de la dinastía Qin), Chen Shou (historiador de la dinastía Jin), Chen Zi'ang (poeta de la dinastía Tang)"
    },
    "yang": {
      "origin": "El apellido Yang se originó del apellido ancestral Ji, que se remonta al rey Wen de Zhou. El primer antepasado fue Yang Boqiao, un ministro de la dinastía Zhou.",
      "history": "El apellido Yang es uno de los apellidos más grandes de China, con una historia de más de 2,800 años. Durante las dinastías Han y Tang, el apellido Yang produjo muchas figuras prominentes.",
      "distribution": "El apellido Yang está ampliamente distribuido en todo el país, con una concentración particularmente alta en las provincias de Shaanxi, Shanxi, Henan y Hebei.",
      "famous_people": "Yang Jian (emperador Wen de Sui), Yang Guifei (concubina de la dinastía Tang), Yang Xiong (filósofo de la dinastía Han)"
    },
    "zhao": {
      "origin": "El apellido Zhao se originó del apellido ancestral Ying, que se remonta al emperador Zhuanxu de la antigüedad. El primer antepasado fue Zhao Fu, un ministro de la dinastía Zhou.",
      "history": "El apellido Zhao es uno de los apellidos más grandes de China, con una historia de más de 2,800 años. Durante el Período de los Reinos Combatientes, el apellido Zhao se convirtió en el apellido real del estado de Zhao.",
      "distribution": "El apellido Zhao está ampliamente distribuido en todo el país, con una concentración particularmente alta en las provincias de Hebei, Henan, Shandong y Shanxi.",
      "famous_people": "Zhao Kuangyin (emperador Taizu de Song), Zhao Mengfu (pintor de la dinastía Yuan), Zhao Yiman (héroe revolucionario)"
    },
    "sun": {
      "origin": "El apellido Sun se originó del apellido ancestral Ji, que se remonta al rey Wen de Zhou. El primer antepasado fue Sun Shu'ao, un ministro del estado de Chu durante el Período de Primavera y Otoño.",
      "history": "El apellido Sun es uno de los apellidos más grandes de China, con una historia de más de 2,600 años. Durante el Período de los Tres Reinos, el apellido Sun se convirtió en el apellido real del estado de Wu.",
      "distribution": "El apellido Sun está ampliamente distribuido en todo el país, con una concentración particularmente alta en las provincias de Shandong, Henan, Hebei y Jiangsu.",
      "famous_people": "Sun Wu (estratega militar), Sun Quan (emperador de Wu), Sun Yat-sen (líder revolucionario)"
    },
    "zhou": {
      "origin": "El apellido Zhou se originó del apellido ancestral Ji, que se remonta al rey Wen de Zhou. El primer antepasado fue Zhou Gong Dan, un ministro de la dinastía Zhou.",
      "history": "El apellido Zhou es uno de los apellidos más grandes de China, con una historia de más de 3,000 años. Durante la dinastía Zhou, el apellido Zhou se convirtió en el apellido real, lo que llevó a su gran desarrollo.",
      "distribution": "El apellido Zhou está ampliamente distribuido en todo el país, con una concentración particularmente alta en las provincias de Henan, Shandong, Hebei y Jiangsu.",
      "famous_people": "Zhou Gong Dan (estadista de la dinastía Zhou), Zhou Yu (general de Wu), Zhou Enlai (primer ministro de la República Popular China)"
    },
    "wu": {
      "origin": "El apellido Wu se originó del apellido ancestral Ji, que según la leyenda desciende del rey Wu de Zhou (Ji Fa). Recibió su nombre por el feudo de Wu (actual Suzhou en la provincia de Jiangsu).",
      "history": "El apellido Wu ya era común durante el período de Primavera y Otoño. Históricamente, hubo estados como el Estado de Wu.",
      "distribution": "El apellido Wu está ampliamente distribuido en todo el país, con una concentración particularmente alta en las provincias de Jiangsu y Zhejiang.",
      "famous_people": "Wu Qi (estratega militar), Wu Daozi (famoso pintor de la dinastía Tang), Wu Cheng'en (autor de 'Viaje al Oeste'), Wu Jingzi (escritor de la dinastía Qing)"
    }
  }
}
