{
  "common": {
    "language": "Français",
    "title": "CC Name - Système de recommandation de noms basé sur la culture chinoise",
    "description": "Un système de recommandation de noms basé sur la poésie chinoise ancienne, les classiques et les principes des cinq éléments (Wu Xing) et du Yi Jing",
    "not_found": "Page non trouvée",
    "path_not_exists": "Le chemin que vous essayez d'accéder n'existe pas",
    "page_moved": "Cette page a peut-être été déplacée ou supprimée",
    "back_home": "Retour à l'accueil",
    "data_not_found": "Paramètre de données non trouvé",
    "url_decode_error": "Échec du décodage URL: format de données invalide",
    "json_parse_error": "Échec de l'analyse JSON: format de données invalide",
    "data_processing_error": "Une erreur s'est produite lors du traitement des données",
    "general_error": "Une erreur s'est produite. Veuillez réessayer plus tard."
  },
  "header": {
    "home": "Accueil",
    "surnameculture": "Culture des noms de famille",
    "about": "À propos",
    "login": "Connexion"
  },
  "home": {
    "slogan": "Sagesse traditionnelle · Noms modernes",
    "description": "Combinant l'essence de la culture traditionnelle du 'Shijing' et des 'Quatre Livres et Cinq Classiques' avec la profonde sagesse du Wu Xing et Yi Jing pour créer une carte de nom personnelle unique pour vous.",
    "wuxing": "Cinq Éléments",
    "wuxing_desc": "Basé sur votre date et heure de naissance, correspondant précisément aux attributs des Cinq Éléments pour assurer que votre nom s'harmonise avec votre destin",
    "shijing": "Références poétiques",
    "shijing_desc": "S'inspirant du Livre des Odes, incorporant la culture classique pour insuffler à votre nom une signification culturelle profonde",
    "wuxing_tooltip": "Les Cinq Éléments (Métal, Bois, Eau, Feu, Terre) sont une théorie importante dans la philosophie chinoise ancienne qui explique la composition du monde naturel et ses lois de mouvement et de changement. Cette théorie soutient que tout dans le monde est composé des Cinq Éléments, qui se promeuvent et se restreignent mutuellement : le Bois promeut le Feu, le Feu promeut la Terre, la Terre promeut le Métal, le Métal promeut l'Eau, et l'Eau promeut le Bois. Dans la nomination, le principe de promotion et de restriction mutuelle des Cinq Éléments peut aider à équilibrer le destin et apporter la bonne fortune tout en évitant le malheur.",
    "shijing_tooltip": "Le 'Shijing' (Livre des Odes) est la plus ancienne collection de poésie de Chine, contenant 311 poèmes du début de la dynastie Zhou occidentale jusqu'au milieu de la période des Printemps et Automnes (XIe au VIe siècle av. J.-C.). Il contient de riches connotations culturelles, de belles images et un profond esprit humain. En nommant, s'inspirer des allusions et des images du 'Shijing' donne non seulement aux noms une base culturelle de grande portée, mais continue également l'essence de la culture chinoise."
  },
  "form": {
    "title": "Trouvez votre nom destiné",
    "birthdate": "Date de naissance",
    "birthdate_placeholder": "Sélectionnez votre date de naissance",
    "birthdate_required": "Veuillez fournir une date de naissance",
    "birthdate_invalid": "Veuillez fournir une date de naissance valide",
    "birthtime": "Heure de naissance",
    "gender": "Genre",
    "male": "Masculin",
    "female": "Féminin",
    "neutral": "Neutre",
    "surname": "Nom de famille",
    "surname_placeholder": "Entrez votre nom de famille (facultatif)",
    "surname_error": "Veuillez entrer 1-2 caractères chinois",
    "date_error": "Veuillez utiliser le format de date correct : yyyy/MM/dd",
    "submit": "Générer des recommandations de noms",
    "loading": "Génération...",
    "generation_error": "Erreur lors de la génération de noms, veuillez réessayer",
    "form_title": "Remplir les informations de base",
    "time_range": "Plage horaire de naissance",
    "time_range_morning": "Matin (Heure Zi - Heure Mao)",
    "time_range_afternoon": "Après-midi (Heure Chen - Heure Wei)",
    "time_range_evening": "Soir (Heure Shen - Heure Xu)",
    "time_range_night": "Nuit (Heure Hai - Heure Chou)",
    "timezones": {
      "zi": "Heure Zi (0:00-2:00)",
      "chou": "Heure Chou (2:00-4:00)",
      "yin": "Heure Yin (4:00-6:00)",
      "mao": "Heure Mao (6:00-8:00)",
      "chen": "Heure Chen (8:00-10:00)",
      "si": "Heure Si (10:00-12:00)",
      "wu": "Heure Wu (12:00-14:00)",
      "wei": "Heure Wei (14:00-16:00)",
      "shen": "Heure Shen (16:00-18:00)",
      "you": "Heure You (18:00-20:00)",
      "xu": "Heure Xu (20:00-22:00)",
      "hai": "Heure Hai (22:00-24:00)"
    }
  },
  "result": {
    "title": "Analyse de votre nom",
    "introduction": "Sur la base de vos informations de naissance, nous avons généré les recommandations de noms suivantes pour vous :",
    "name_recommendation": "Noms recommandés",
    "five_elements": "Analyse des cinq éléments",
    "poetic_reference": "Référence poétique",
    "name_meaning": "Signification du nom",
    "name_score": "Score du nom",
    "compatibility": "Compatibilité avec le thème natal",
    "cultural_depth": "Profondeur culturelle",
    "uniqueness": "Originalité",
    "pronunciation": "Esthétique de prononciation",
    "try_again": "Générer à nouveau",
    "back_to_home": "Retour à l'accueil",
    "name_analysis": "Raisonnement des cinq éléments",
    "language_notice": "La sélection de la langue est désactivée sur cette page. Veuillez revenir à la page d'accueil si vous souhaitez changer de langue.",
    "elements": {
      "metal": "Métal",
      "wood": "Bois",
      "water": "Eau",
      "fire": "Feu",
      "earth": "Terre"
    }
  },
  "footer": {
    "copyright": "© 2025 CC Name. Tous droits réservés.",
    "privacy": "Politique de confidentialité",
    "terms": "Conditions d'utilisation",
    "contact": "Contactez-nous"
  },
  "feedback": {
    "title": "Commentaires des Utilisateurs",
    "anonymous": "Utilisateur Anonyme",
    "name_label": "Votre Nom (facultatif)",
    "email_label": "Courriel (facultatif)",
    "message_label": "Contenu du Commentaire",
    "submit": "Envoyer le Commentaire",
    "submitting": "Envoi en cours...",
    "thank_you": "Merci pour votre commentaire ! Nous examinerons attentivement vos suggestions.",
    "continue": "Continuer le Commentaire",
    "error_message": "Erreur lors de l'envoi, veuillez réessayer plus tard ou nous contacter par d'autres moyens.",
    "timeout_message": "Délai d'envoi dépassé, veuillez vérifier votre connexion réseau et réessayer."
  },
  "about": {
    "title": "À Propos de Nous",
    "intro": {
      "p1": "Nous sommes une équipe dédiée à l'héritage de la culture traditionnelle chinoise, axée sur la fourniture de services de recommandation de noms à patrimoine culturel.",
      "p2": "Combinant les principes traditionnels de dénomination et l'analyse de données modernes, nous offrons des options de noms uniques et significatifs pour chaque famille."
    },
    "philosophy": {
      "title": "Notre Philosophie",
      "item1": "Respecter la tradition, hériter de la culture",
      "item2": "Analyse scientifique, recommandations précises",
      "item3": "Service professionnel, attention soignée"
    },
    "advantages": {
      "title": "Nos Avantages",
      "team": {
        "title": "Équipe Professionnelle",
        "description": "Une équipe professionnelle avec des années d'expérience en dénomination, profondément versée dans l'essence de la culture traditionnelle"
      },
      "method": {
        "title": "Méthode Scientifique",
        "description": "Combinant la culture traditionnelle avec des méthodes analytiques modernes pour vous fournir les meilleures recommandations"
      }
    },
    "contact": {
      "intro": "Si vous avez des questions ou des suggestions, n'hésitez pas à nous contacter",
      "email": {
        "title": "Courriel"
      }
    }
  },
  "surname": {
    "title": "Culture des Noms de Famille Chinois",
    "subtitle": "Explorez cinq mille ans d'origines des noms de famille, héritez de l'empreinte de la civilisation chinoise",
    "banner": {
      "alt": "Histoire des Cent Noms de Famille"
    },
    "wiki_link": "Explorer plus d'origines de noms de famille",
    "origin": {
      "title": "Origine et Évolution des Noms de Famille",
      "description": "La culture des noms de famille chinois a une longue histoire qui remonte à l'antiquité. Initialement, il y avait une distinction entre 'xing' (姓) et 'shi' (氏) : 'xing' représentait les relations de sang, tandis que 'shi' indiquait le statut social ou la division territoriale."
    },
    "distribution": {
      "title": "Cent Noms de Famille et Distribution Régionale",
      "ranking": "Classement des Noms de Famille",
      "ranking_desc": "Les noms de famille les plus courants en Chine actuellement sont Li, Wang, Zhang, Liu, Chen, etc. La distribution et la migration de ces noms de famille reflètent le mouvement de population et l'intégration culturelle tout au long de l'histoire chinoise.",
      "regional": "Caractéristiques Régionales",
      "regional_desc": "Les noms de famille courants dans les régions du sud diffèrent de ceux du nord, ce qui est étroitement lié aux vagues migratoires historiques, à l'environnement géographique et aux traditions culturelles."
    },
    "navigation": {
      "title": "Navigation Rapide",
      "origin": "Origine des Noms",
      "distribution": "Distribution Régionale",
      "culture": "Culture des Noms"
    }
  },
  "surnames": {
    "li": {
      "origin": "Le nom de famille Li provient principalement de l'empereur Li (嬴), fils de l'empereur Zhuanxu. Il est également associé au nom de famille Ying (嬴) de l'État de Qin.",
      "history": "Li est l'un des noms de famille les plus communs en Chine. Pendant la dynastie Tang, la famille impériale Li a grandement contribué à sa popularité.",
      "distribution": "Largement répandu dans toute la Chine, avec une concentration particulière dans les provinces du Henan, Shandong et Shaanxi.",
      "famous_people": "Li Bai (grand poète de la dynastie Tang), Li Shimin (Empereur Taizong des Tang), Li Yuan (fondateur de la dynastie Tang)"
    },
    "wang": {
      "origin": "Le nom Wang provient du titre de noblesse 'wang' (roi). Il était initialement accordé aux descendants de la famille royale de la période des Zhou.",
      "history": "Wang est devenu l'un des noms de famille les plus répandus en Chine, particulièrement après la période des Printemps et Automnes.",
      "distribution": "Très commun dans le nord de la Chine, notamment dans les provinces du Shandong, Henan et Hebei.",
      "famous_people": "Wang Xizhi (célèbre calligraphe), Wang Wei (poète et peintre de la dynastie Tang), Wang Yangming (philosophe de la dynastie Ming)"
    },
    "zhang": {
      "origin": "Le nom Zhang est dérivé du nom de fief Zhang (漳), situé dans l'actuelle province du Henan.",
      "history": "L'un des plus anciens noms de famille chinois, remontant à la période des Printemps et Automnes.",
      "distribution": "Particulièrement répandu dans les provinces du nord et du centre de la Chine.",
      "famous_people": "Zhang Qian (diplomate de la dynastie Han), Zhang Heng (astronome et inventeur), Zhang Yimou (réalisateur contemporain)"
    },
    "liu": {
      "origin": "Le nom Liu provient du nom de fief Liu (劉), situé dans l'actuelle province du Henan.",
      "history": "La famille impériale de la dynastie Han portait ce nom, contribuant grandement à sa popularité.",
      "distribution": "Largement répandu dans toute la Chine, avec une forte présence dans les provinces du Shandong et du Henan.",
      "famous_people": "Liu Bang (fondateur de la dynastie Han), Liu Bei (fondateur du royaume de Shu), Liu Cixin (écrivain de science-fiction)"
    },
    "chen": {
      "origin": "Le nom Chen provient de l'État de Chen de la période des Printemps et Automnes, initialement issu du nom de famille Gui.",
      "history": "L'État de Chen a joué un rôle important dans l'histoire chinoise ancienne, contribuant à la propagation de ce nom.",
      "distribution": "Particulièrement commun dans les provinces du sud-est de la Chine, notamment le Fujian, le Guangdong et le Zhejiang.",
      "famous_people": "Chen Sheng (leader de la première révolte paysanne), Chen Shou (historien de la période des Trois Royaumes)"
    },
    "yang": {
      "origin": "Le nom Yang est lié au territoire de Yang pendant la période des Zhou de l'Ouest.",
      "history": "Ce nom a gagné en importance pendant la dynastie Sui, dont le fondateur était Yang Jian.",
      "distribution": "Largement répandu dans les provinces du Shaanxi, Shanxi et Sichuan.",
      "famous_people": "Yang Guifei (concubine impériale des Tang), Yang Yan Zhao (général de la dynastie Song)"
    },
    "zhao": {
      "origin": "Le nom Zhao provient de l'État de Zhao pendant la période des Royaumes Combattants.",
      "history": "L'État de Zhao était l'un des sept royaumes majeurs de la période des Royaumes Combattants.",
      "distribution": "Particulièrement commun dans le nord de la Chine, notamment dans les provinces du Hebei et du Shanxi.",
      "famous_people": "Zhao Kuangyin (fondateur de la dynastie Song), Zhao Yun (général de la période des Trois Royaumes)"
    },
    "sun": {
      "origin": "Le nom Sun est lié à la descendance de Huangdi et au territoire de Sun.",
      "history": "Ce nom a gagné en importance pendant la période des Trois Royaumes avec Sun Quan.",
      "distribution": "Particulièrement répandu dans les provinces du Shandong et du Jiangsu.",
      "famous_people": "Sun Wu (Sun Tzu, auteur de L'Art de la Guerre), Sun Yat-sen (père fondateur de la Chine moderne)"
    },
    "zhou": {
      "origin": "Le nom Zhou est lié à la dynastie Zhou et au territoire de Zhou.",
      "history": "L'un des plus anciens noms de famille chinois, étroitement lié à la dynastie Zhou.",
      "distribution": "Largement répandu dans toute la Chine, avec une concentration particulière dans les provinces centrales.",
      "famous_people": "Zhou Gong Dan (duc de Zhou), Zhou Enlai (premier Premier ministre de la République populaire de Chine)"
    },
    "wu": {
      "origin": "Le nom Wu est issu du clan Ji, descendant selon la légende du roi Wu de Zhou (Ji Fa). Il tire son nom du fief de Wu (actuellement Suzhou dans la province du Jiangsu).",
      "history": "Le nom Wu était déjà courant pendant la période des Printemps et Automnes. Historiquement, il y a eu des états comme l'État de Wu.",
      "distribution": "Largement répandu dans toute la Chine, avec une concentration particulière dans les provinces du Jiangsu et du Zhejiang.",
      "famous_people": "Wu Qi (stratège militaire), Wu Daozi (peintre célèbre de la dynastie Tang), Wu Cheng'en (auteur du 'Voyage en Occident'), Wu Jingzi (écrivain de la dynastie Qing)"
    }
  }
}
