{
  "common": {
    "language": "português",
    "title": "CC Name - Sistema de recomendação de nomes baseado na cultura chinesa",
    "description": "Sistema de recomendação de nomes baseado na poesia clássica chinesa e nos princípios de Wu Xing e Yi Jing",
    "not_found": "Página não encontrada",
    "path_not_exists": "O caminho que você está tentando acessar não existe",
    "page_moved": "Esta página pode ter sido movida ou removida",
    "back_home": "Voltar para a página inicial",
    "data_source_description": "O método principal utiliza uma tabela de consulta para conversão, com dados de",
    "hko_calendar_conversion": "Observatório de Hong Kong [Conversão entre Calendário Solar e Lunar]"
  },
  "header": {
    "home": "Início",
    "surnameculture": "Cultura dos sobrenomes",
    "about": "Sobre nós",
    "login": "Entrar"
  },
  "home": {
    "slogan": "Sabedoria Tradicional · Nomes Modernos",
    "description": "Combinando a essência da cultura tradicional do 'Shijing' e dos 'Quatro Livros e Cinco Clássicos' com a profunda sabedoria do Wu Xing e Yi Jing para criar um gráfico de nome único para você.",
    "wuxing": "Cinco Elementos",
    "wuxing_desc": "Com base na sua data e hora de nascimento, combinando precisamente os atributos dos Cinco Elementos para garantir que seu nome harmonize com seu destino",
    "shijing": "Referências Poéticas",
    "shijing_desc": "Inspirando-se no Livro das Odes, incorporando a cultura clássica para infundir ao seu nome um profundo significado cultural",
    "wuxing_tooltip": "Os Cinco Elementos (Metal, Madeira, Água, Fogo, Terra) são uma teoria importante na filosofia chinesa antiga que explica a composição do mundo natural e suas leis de movimento e mudança. Esta teoria sustenta que tudo no mundo é composto pelos Cinco Elementos, que se promovem e restringem mutuamente: a Madeira promove o Fogo, o Fogo promove a Terra, a Terra promove o Metal, o Metal promove a Água, e a Água promove a Madeira. Na nomeação, o princípio de promoção e restrição mútua dos Cinco Elementos pode ajudar a equilibrar o destino de uma pessoa e trazer boa fortuna enquanto evita o infortúnio.",
    "shijing_tooltip": "O 'Shijing' (Livro das Odes) é a mais antiga coleção de poesia da China, contendo 311 poemas desde o início da dinastia Zhou ocidental até meados do período da Primavera e Outono (séculos XI a VI a.C.). Contém ricas conotações culturais, belas imagens e um profundo espírito humano. Na nomeação, inspirar-se nas alusões e imagens do 'Shijing' não só dá aos nomes uma base cultural de longo alcance, mas também continua a essência da cultura chinesa.",
    "hover_for_details": "Passe o mouse para uma introdução detalhada",
    "shijing_quote": "Guan-guan gritam as águias-pescadoras, no ilhéu no rio. A moça modesta, recatada, virtuosa: para nosso príncipe, uma boa companheira.",
    "shijing_source": "Livro das Odes, Guanju",
    "classics_in_naming": "Aplicação da cultura clássica na nomeação",
    "classics_point1": "Extraindo belas imagens de clássicos como Shijing e Chuci",
    "classics_point2": "Incorporando o contexto cultural tradicional para dar aos nomes um significado profundo",
    "classics_point3": "Herdando a essência da civilização chinesa, conectando a cultura antiga e moderna",
    "shijing_naming": "Um bom nome não é apenas uma combinação de caracteres, mas a herança e inovação da cultura tradicional.",
    "wuxing_naming": "Aplicação dos Cinco Elementos na nomeação: selecionando caracteres com atributos correspondentes com base na deficiência no mapa de nascimento para alcançar o equilíbrio.",
    "metal_desc": "Forte e resoluto, simbolizando decisão e outono",
    "wood_desc": "Crescente e flexível, simbolizando inovação e primavera",
    "water_desc": "Fluido e sábio, simbolizando adaptabilidade e inverno",
    "fire_desc": "Apaixonado e energético, simbolizando mudança e verão",
    "earth_desc": "Estável e inclusivo, simbolizando harmonia e fim das estações",
    "intro_title": "Explorando a filosofia tradicional chinesa de nomeação"
  },
  "form": {
    "title": "Encontre seu nome predestinado",
    "birthdate": "Data de nascimento",
    "birthdate_placeholder": "Selecione sua data de nascimento",
    "birthdate_required": "Por favor, forneça a data de nascimento",
    "birthdate_invalid": "Por favor, forneça uma data de nascimento válida",
    "birthtime": "Hora de nascimento",
    "gender": "Gênero",
    "male": "Masculino",
    "female": "Feminino",
    "neutral": "Neutro",
    "surname": "Sobrenome",
    "surname_placeholder": "Digite seu sobrenome (opcional)",
    "surname_error": "Por favor, digite 1-2 caracteres chineses",
    "date_error": "Por favor, use o formato correto de data: aaaa/mm/dd",
    "submit": "Gerar recomendações de nomes",
    "loading": "Gerando...",
    "generation_error": "Erro ao gerar o nome, por favor tente novamente",
    "form_title": "Preencha as informações básicas",
    "time_range": "Período de nascimento",
    "time_range_morning": "Manhã (Zi Shi - Mao Shi)",
    "time_range_afternoon": "Tarde (Chen Shi - Wei Shi)",
    "time_range_evening": "Anoitecer (Shen Shi - Xu Shi)",
    "time_range_night": "Noite (Hai Shi - Chou Shi)",
    "network_timeout_error": "Tempo limite da solicitação de rede excedido, verifique sua conexão e tente novamente",
    "try_again": "Tentar novamente",
    "name_generating": "Estamos trabalhando intensamente para gerar recomendações de nomes personalizadas para você, por favor aguarde...",
    "almost_done": "Quase pronto, só mais um momento...",
    "timezones": {
      "zi": "Zi Shi (0:00-2:00)",
      "chou": "Chou Shi (2:00-4:00)",
      "yin": "Yin Shi (4:00-6:00)",
      "mao": "Mao Shi (6:00-8:00)",
      "chen": "Chen Shi (8:00-10:00)",
      "si": "Si Shi (10:00-12:00)",
      "wu": "Wu Shi (12:00-14:00)",
      "wei": "Wei Shi (14:00-16:00)",
      "shen": "Shen Shi (16:00-18:00)",
      "you": "You Shi (18:00-20:00)",
      "xu": "Xu Shi (20:00-22:00)",
      "hai": "Hai Shi (22:00-24:00)"
    }
  },
  "result": {
    "title": "Análise do seu nome",
    "introduction": "Com base nas suas informações de nascimento, geramos as seguintes recomendações de nomes para você:",
    "name_recommendation": "Nomes recomendados",
    "five_elements": "Análise Wu Xing",
    "poetic_reference": "Referências poéticas",
    "name_meaning": "Significado do nome",
    "name_score": "Pontuação do nome",
    "compatibility": "Compatibilidade com o destino",
    "cultural_depth": "Profundidade cultural",
    "uniqueness": "Singularidade",
    "pronunciation": "Estética fonética",
    "back_to_home": "Voltar para a página inicial",
    "name_analysis": "Raciocínio Wu Xing",
    "language_notice": "A função de alteração de idioma está desativada nesta página. Para mudar o idioma, por favor retorne à página inicial.",
    "elements": {
      "metal": "Metal",
      "wood": "Madeira",
      "water": "Água",
      "fire": "Fogo",
      "earth": "Terra"
    }
  },
  "footer": {
    "copyright": "© 2025 CC Name. Todos os direitos reservados.",
    "privacy": "Política de privacidade",
    "terms": "Termos de uso",
    "contact": "Contate-nos"
  },
  "feedback": {
    "title": "Feedback do usuário",
    "anonymous": "Usuário anônimo",
    "name_label": "Seu nome (opcional)",
    "email_label": "E-mail (opcional)",
    "message_label": "Conteúdo do feedback",
    "submit": "Enviar feedback",
    "submitting": "Enviando...",
    "thank_you": "Obrigado pelo seu feedback! Estudaremos suas sugestões com atenção.",
    "continue": "Continuar fornecendo feedback",
    "error_message": "Falha no envio, por favor tente novamente mais tarde ou entre em contato conosco por outros meios.",
    "timeout_message": "Tempo esgotado para envio, por favor verifique sua conexão com a internet e tente novamente."
  },
  "about": {
    "title": "Sobre nós",
    "intro": {
      "p1": "Somos uma equipe dedicada a preservar a cultura tradicional chinesa e oferecer serviços de recomendação de nomes com profundo significado cultural.",
      "p2": "Combinando princípios tradicionais de nomeação com análise de dados moderna, proporcionamos a cada família escolhas de nomes únicas e significativas."
    },
    "philosophy": {
      "title": "Nossa filosofia",
      "item1": "Respeitar a tradição, preservar a cultura",
      "item2": "Análise científica, recomendações precisas",
      "item3": "Serviço profissional, cuidado atencioso"
    },
    "advantages": {
      "title": "Nossas vantagens",
      "team": {
        "title": "Equipe profissional",
        "description": "Uma equipe profissional com anos de experiência em nomenclatura, compreendendo profundamente a essência da cultura tradicional"
      },
      "method": {
        "title": "Método científico",
        "description": "Combinação de cultura tradicional e métodos de análise modernos para fornecer as melhores recomendações"
      }
    },
    "contact": {
      "intro": "Se você tiver alguma dúvida ou sugestão, não hesite em nos contatar",
      "email": {
        "title": "E-mail"
      }
    }
  },
  "surname": {
    "title": "Cultura dos sobrenomes chineses",
    "subtitle": "Explore os cinco mil anos de origem dos sobrenomes, herança da civilização chinesa",
    "banner": {
      "alt": "História do Bai Jia Xing (Cem Sobrenomes)"
    },
    "wiki_link": "Explore mais sobre a origem dos sobrenomes",
    "origin": {
      "title": "Origem e evolução dos sobrenomes",
      "description": "A cultura dos sobrenomes chineses tem uma longa história, remontando aos tempos antigos. Inicialmente, havia uma distinção entre 'xing' (姓) e 'shi' (氏): 'xing' representava relações de sangue, enquanto 'shi' indicava status social ou divisão territorial."
    },
    "distribution": {
      "title": "Bai Jia Xing e distribuição geográfica",
      "ranking": "Classificação dos sobrenomes",
      "ranking_desc": "Atualmente, os sobrenomes mais comuns na China são Li, Wang, Zhang, Liu, Chen, etc. A distribuição desses sobrenomes reflete o processo de migração populacional e fusão cultural na história chinesa.",
      "regional": "Características regionais",
      "regional_desc": "Os sobrenomes comuns nas regiões do sul diferem dos do norte, o que está intimamente relacionado com as ondas históricas de migração, geografia e tradições culturais."
    },
    "navigation": {
      "title": "Navegação rápida",
      "origin": "Origem dos sobrenomes",
      "distribution": "Distribuição geográfica",
      "culture": "Cultura dos sobrenomes"
    }
  },
  "surnames": {
    "li": {
      "origin": "Originado dos descendentes de Bo Yi, inicialmente usando o sobrenome 'Li' do cargo oficial, que depois foi alterado para o atual caractere. Há também uma teoria que sugere origem do Imperador Yan (Shennong).",
      "history": "Li é o sobrenome mais comum na China. A dinastia mais famosa com este sobrenome foi a Dinastia Tang, fundada por Li Yuan. O sobrenome Li já era comum durante o período das Primaveras e Outonos, atingindo seu auge durante a Dinastia Tang.",
      "distribution": "Distribuído por todo o país, com concentração particular nas províncias de Shaanxi e Gansu",
      "famousPeople": {
        "liBai": "Li Bai",
        "liQingZhao": "Li Qingzhao",
        "liShangYin": "Li Shangyin",
        "liShiMin": "Li Shimin"
      }
    },
    "wang": {
      "origin": "Originado na antiguidade, é um dos sobrenomes mais antigos. Segundo a lenda, foi usado pelos descendentes de Wang Hai.",
      "history": "Wang é o segundo sobrenome mais comum na China. Já era um sobrenome importante durante o período das Primaveras e Outonos. Historicamente, dizia-se que havia '180.000 famílias Wang sob o céu'.",
      "distribution": "Amplamente distribuído por todo o país, com concentração particular nas províncias de Shandong e Hebei",
      "famousPeople": {
        "wangXiZhi": "Wang Xizhi",
        "wangWei": "Wang Wei",
        "wangAnShi": "Wang Anshi",
        "wangYangMing": "Wang Yangming"
      }
    },
    "zhang": {
      "origin": "Originado na antiguidade, segundo a lenda, descendente de Zhang Hu, o inventor do arco e flecha durante o período do Imperador Amarelo.",
      "history": "Zhang é o terceiro sobrenome mais comum na China. Já era proeminente durante o período dos Estados Combatentes. Zhang Liang ajudou Liu Bang a estabelecer a Dinastia Han, aumentando ainda mais o prestígio do sobrenome.",
      "distribution": "Amplamente distribuído por todo o país, com concentração particular nas províncias de Henan e Shandong",
      "famousPeople": {
        "zhangLiang": "Zhang Liang",
        "zhangFei": "Zhang Fei",
        "zhangZeDuan": "Zhang Zeduan",
        "zhangHeng": "Zhang Heng"
      }
    },
    "liu": {
      "origin": "Originado do clã Ji, segundo a lenda, descendente do Imperador Amarelo. Liu Lei recebeu este sobrenome por sua habilidade em treinar cavalos-dragão.",
      "history": "Liu é o quarto sobrenome mais comum na China. A dinastia mais ilustre com este sobrenome foi a Dinastia Han, fundada por Liu Bang, que durou mais de 400 anos.",
      "distribution": "Amplamente distribuído por todo o país, com concentração particular nas províncias de Henan, Shandong e Anhui",
      "famousPeople": {
        "liuBang": "Liu Bang",
        "liuBei": "Liu Bei",
        "liuYuXi": "Liu Yuxi",
        "liuShaoQi": "Liu Shaoqi"
      }
    },
    "chen": {
      "origin": "Originado do clã Gui, segundo a lenda, descendente do Imperador Shun. Recebeu o sobrenome devido ao feudo em Chen (atual Huaiyang, Henan).",
      "history": "Chen é o quinto sobrenome mais comum na China. Durante o período das Primaveras e Outonos, estabeleceu o Estado de Chen. Durante as Dinastias do Sul, também surgiu a Dinastia Chen.",
      "distribution": "Amplamente distribuído por todo o país, com concentração particular nas províncias de Fujian, Guangdong e Zhejiang",
      "famousPeople": {
        "chenSheng": "Chen Sheng",
        "chenShou": "Chen Shou",
        "chenZiAng": "Chen Ziang",
        "chenDuXiu": "Chen Duxiu"
      }
    },
    "yang": {
      "origin": "Originado do clã Ji, segundo a lenda, descendente do nono filho do Rei Wen de Zhou, Shu Liang He. Recebeu o sobrenome devido ao feudo em Yang Yi.",
      "history": "Yang já era comum durante o período dos Estados Combatentes. O imperador Yang Jian, fundador da Dinastia Sui, trouxe ainda mais prestígio ao sobrenome.",
      "distribution": "Amplamente distribuído por todo o país, com concentração particular nas províncias de Shaanxi e Sichuan",
      "famousPeople": {
        "yangJian": "Yang Jian",
        "yangGuiFei": "Yang Guifei",
        "yangYanZhao": "Yang Yanzhao",
        "yangJiang": "Yang Jiang"
      }
    },
    "zhao": {
      "origin": "Originado do clã Ying, segundo a lenda, descendente de Zaofu. Recebeu o sobrenome devido ao feudo em Zhao Cheng (atual Hongdong, Shanxi).",
      "history": "Zhao é um sobrenome famoso na história chinesa. O Estado de Zhao durante o período dos Estados Combatentes foi estabelecido pelo clã Zhao.",
      "distribution": "Amplamente distribuído por todo o país, com concentração particular nas províncias de Shanxi e Hebei",
      "famousPeople": {
        "zhaoWuLingWang": "Rei Zhao Wuling",
        "zhaoKuangYin": "Zhao Kuangyin",
        "zhaoYun": "Zhao Yun",
        "zhaoMengFu": "Zhao Mengfu"
      }
    },
    "sun": {
      "origin": "Originado do clã Ji, segundo a lenda, descendente de Sun Shudu, filho do Rei Wen de Zhou.",
      "history": "Sun já era comum durante o período das Primaveras e Outonos. Durante o período dos Três Reinos, Sun Quan estabeleceu o Estado de Wu.",
      "distribution": "Amplamente distribuído por todo o país, com concentração particular nas províncias de Shandong e Jiangsu",
      "famousPeople": {
        "sunWu": "Sun Wu",
        "sunQuan": "Sun Quan",
        "sunYatSen": "Sun Yat-sen",
        "sunSiMiao": "Sun Simiao"
      }
    },
    "zhou": {
      "origin": "Originado do clã Ji, segundo a lenda, descendente do Rei Wen de Zhou, Ji Chang.",
      "history": "Zhou é um dos sobrenomes mais antigos da China. Os governantes da Dinastia Zhou eram do clã Zhou.",
      "distribution": "Amplamente distribuído por todo o país, com concentração particular nas províncias de Hunan e Jiangxi",
      "famousPeople": {
        "zhouGongDan": "Zhou Gong Dan",
        "zhouDunYi": "Zhou Dunyi",
        "zhouEnLai": "Zhou Enlai",
        "zhouShuRen": "Zhou Shuren"
      }
    },
    "wu": {
      "origin": "Originado do clã Ji, segundo a lenda, descendente do Rei Wu de Zhou, Ji Fa. Recebeu o sobrenome devido ao feudo em Wu (atual Suzhou, Jiangsu).",
      "history": "Wu já era comum durante o período das Primaveras e Outonos. Historicamente, houve estados como o Estado de Wu.",
      "distribution": "Amplamente distribuído por todo o país, com concentração particular nas províncias de Jiangsu e Zhejiang",
      "famousPeople": {
        "wuQi": "Wu Qi",
        "wuDaoZi": "Wu Daozi",
        "wuChengEn": "Wu Cheng'en",
        "wuJingZi": "Wu Jingzi"
      }
    }
  }
}
