{
  "common": {
    "language": "русский",
    "title": "CC Name - Система рекомендации имен на основе китайской культуры",
    "description": "Система рекомендации имен на основе древнекитайской культуры и принципов У-син и И-цзин",
    "not_found": "Страница не найдена",
    "path_not_exists": "Путь, который вы пытаетесь открыть, не существует",
    "page_moved": "Эта страница могла быть перемещена или удалена",
    "back_home": "Вернуться на главную"
  },
  "header": {
    "home": "Главная",
    "surnameculture": "Культура фамилий",
    "about": "О нас",
    "login": "Вход"
  },
  "home": {
    "slogan": "Традиционная мудрость · Современное именование",
    "description": "Объединяя эссенцию традиционной культуры из Ши-цзин, Четырех книг и Пяти классиков с глубокой мудростью У-син и И-цзин, мы создаем для вас уникальное полотно имен.",
    "wuxing": "Элементы У-син",
    "wuxing_desc": "На основе вашей даты и времени рождения, мы точно подбираем атрибуты У-син, гарантируя гармонию вашего имени с судьбой",
    "shijing": "Поэтические аллюзии",
    "shijing_desc": "Черпая вдохновение из классической поэзии, мы обогащаем ваше имя глубоким культурным содержанием",
    "wuxing_tooltip": "У-син (металл, дерево, вода, огонь, земля) - важная теория в древнекитайской философии, объясняющая состав и законы изменения природы. Эта теория утверждает, что все в мире состоит из пяти элементов, которые взаимодействуют друг с другом: дерево порождает огонь, огонь порождает землю, земля порождает металл, металл порождает воду, вода порождает дерево. В именовании, применение принципов взаимодействия У-син помогает сбалансировать судьбу, привлечь удачу и избежать несчастий.",
    "shijing_tooltip": "«Ши-цзин» (Книга песен) - древнейший сборник китайской поэзии, содержащий 311 стихотворений с начала Западной Чжоу до середины периода Весны и Осени (11-6 век до н.э.). Он богат культурными коннотациями, красивыми образами и глубоким гуманистическим духом. Черпая вдохновение из образов и аллюзий «Ши-цзин» при выборе имени, мы не только наделяем имя богатым культурным контекстом, но и передаем сущность китайской культуры.",
    "hover_for_details": "Наведите для подробной информации",
    "shijing_quote": "Гуань-гуань кричат скопы на островке в реке. Скромная, добродетельная, прелестная девушка - для нашего государя хорошая пара.",
    "shijing_source": "«Ши-цзин, Гуаньцзюй»",
    "classics_in_naming": "Применение классической культуры в именовании",
    "classics_point1": "Извлечение прекрасных образов из классических произведений, таких как Ши-цзин и Чу цы",
    "classics_point2": "Интеграция традиционного культурного контекста для придания имени глубокого смысла",
    "classics_point3": "Унаследование сущности китайской цивилизации, соединение древней и современной культуры",
    "shijing_naming": "Хорошее имя - это не просто комбинация символов, но наследие и инновация традиционной культуры.",
    "wuxing_naming": "Применение У-син в именовании: выбор символов с соответствующими атрибутами на основе недостатка элементов в карте рождения для достижения баланса.",
    "metal_desc": "Сильный и решительный, символизирует решимость и осень",
    "wood_desc": "Растущий и гибкий, символизирует инновации и весну",
    "water_desc": "Текучий и мудрый, символизирует адаптивность и зиму",
    "fire_desc": "Страстный и энергичный, символизирует изменения и лето",
    "earth_desc": "Стабильный и всеобъемлющий, символизирует гармонию и межсезонье",
    "intro_title": "Исследование традиционной китайской философии именования"
  },
  "form": {
    "title": "Найдите свое судьбоносное имя",
    "birthdate": "Дата рождения",
    "birthdate_placeholder": "Выберите дату рождения",
    "birthdate_required": "Укажите дату рождения",
    "birthdate_invalid": "Укажите действительную дату рождения",
    "birthtime": "Время рождения",
    "gender": "Пол",
    "male": "Мужской",
    "female": "Женский",
    "neutral": "Нейтральный",
    "surname": "Фамилия",
    "surname_placeholder": "Введите фамилию (опционально)",
    "surname_error": "Введите 1-2 китайских иероглифа",
    "date_error": "Используйте правильный формат даты: гггг/мм/дд",
    "submit": "Сгенерировать рекомендации имен",
    "loading": "Генерация...",
    "generation_error": "Ошибка при генерации имени, попробуйте еще раз",
    "form_title": "Заполните основную информацию",
    "time_range": "Период рождения",
    "time_range_morning": "Утро (Цзы-ши - Мао-ши)",
    "time_range_afternoon": "День (Чэнь-ши - Вэй-ши)",
    "time_range_evening": "Вечер (Шэнь-ши - Сюй-ши)",
    "time_range_night": "Ночь (Хай-ши - Чоу-ши)",
    "network_timeout_error": "Время ожидания сетевого запроса истекло, проверьте подключение и попробуйте снова",
    "try_again": "Попробовать снова",
    "name_generating": "Мы усердно работаем над созданием персонализированных рекомендаций имен для вас, пожалуйста, подождите...",
    "almost_done": "Почти готово, еще минутку...",
    "timezones": {
      "zi": "Цзы-ши (0:00-2:00)",
      "chou": "Чоу-ши (2:00-4:00)",
      "yin": "Инь-ши (4:00-6:00)",
      "mao": "Мао-ши (6:00-8:00)",
      "chen": "Чэнь-ши (8:00-10:00)",
      "si": "Сы-ши (10:00-12:00)",
      "wu": "У-ши (12:00-14:00)",
      "wei": "Вэй-ши (14:00-16:00)",
      "shen": "Шэнь-ши (16:00-18:00)",
      "you": "Ю-ши (18:00-20:00)",
      "xu": "Сюй-ши (20:00-22:00)",
      "hai": "Хай-ши (22:00-24:00)"
    }
  },
  "result": {
    "title": "Анализ вашего имени",
    "introduction": "На основе вашей информации о рождении, мы создали следующие рекомендации имен:",
    "name_recommendation": "Рекомендуемые имена",
    "five_elements": "Анализ У-син",
    "poetic_reference": "Поэтические аллюзии",
    "name_meaning": "Значение имени",
    "name_score": "Оценка имени",
    "compatibility": "Совместимость с судьбой",
    "cultural_depth": "Культурная глубина",
    "uniqueness": "Уникальность",
    "pronunciation": "Эстетика звучания",
    "back_to_home": "Вернуться на главную",
    "name_analysis": "Рассуждение о пяти элементах",
    "language_notice": "На этой странице отключена функция смены языка. Чтобы изменить язык, пожалуйста, вернитесь на главную страницу.",
    "elements": {
      "metal": "Металл",
      "wood": "Дерево",
      "water": "Вода",
      "fire": "Огонь",
      "earth": "Земля"
    }
  },
  "footer": {
    "copyright": "© 2025 CC Name. Все права защищены.",
    "privacy": "Политика конфиденциальности",
    "terms": "Условия использования",
    "contact": "Связаться с нами"
  },
  "feedback": {
    "title": "Обратная связь",
    "anonymous": "Анонимный пользователь",
    "name_label": "Ваше имя (опционально)",
    "email_label": "Электронная почта (опционально)",
    "message_label": "Сообщение",
    "submit": "Отправить отзыв",
    "submitting": "Отправка...",
    "thank_you": "Спасибо за ваш отзыв! Мы внимательно изучим ваши предложения.",
    "continue": "Оставить еще отзыв",
    "error_message": "Ошибка при отправке, пожалуйста, попробуйте позже или свяжитесь с нами другим способом.",
    "timeout_message": "Превышено время ожидания, пожалуйста, проверьте подключение к интернету и попробуйте снова."
  },
  "about": {
    "title": "О нас",
    "intro": {
      "p1": "Мы команда, посвятившая себя сохранению традиционной китайской культуры и предоставлению услуг по рекомендации имен с глубоким культурным значением.",
      "p2": "Объединяя традиционные принципы именования с современным анализом данных, мы создаем для каждой семьи уникальные и значимые имена."
    },
    "philosophy": {
      "title": "Наша философия",
      "item1": "Уважение к традициям, сохранение культуры",
      "item2": "Научный анализ, точные рекомендации",
      "item3": "Профессиональный сервис, искренняя забота"
    },
    "advantages": {
      "title": "Наши преимущества",
      "team": {
        "title": "Профессиональная команда",
        "description": "Опытная команда профессионалов с многолетним опытом именования, глубоко понимающая суть традиционной культуры"
      },
      "method": {
        "title": "Научный метод",
        "description": "Сочетание традиционной культуры и современных методов анализа для предоставления наилучших рекомендаций"
      }
    },
    "contact": {
      "intro": "Если у вас есть вопросы или предложения, не стесняйтесь обращаться к нам",
      "email": {
        "title": "Электронная почта"
      }
    }
  },
  "surname": {
    "title": "Культура китайских фамилий",
    "subtitle": "Исследуйте пятитысячелетнюю историю происхождения фамилий, наследие китайской цивилизации",
    "banner": {
      "alt": "История Байцзясин (Ста фамилий)"
    },
    "wiki_link": "Узнать больше о происхождении фамилий",
    "origin": {
      "title": "Происхождение и эволюция фамилий",
      "description": "Культура китайских фамилий имеет долгую историю, уходящую в древние времена. Изначально существовало различие между 'син' (姓) и 'ши' (氏): 'син' представляло родство по крови, а 'ши' обозначало социальный статус или территориальное деление."
    },
    "distribution": {
      "title": "Байцзясин и географическое распределение",
      "ranking": "Рейтинг фамилий",
      "ranking_desc": "Сегодня наиболее распространенными фамилиями в Китае являются Ли, Ван, Чжан, Лю, Чэнь и др. Распределение этих фамилий отражает процессы миграции населения и культурного слияния в истории Китая.",
      "regional": "Региональные особенности",
      "regional_desc": "Распространенные фамилии в южных регионах отличаются от северных, что тесно связано с историческими волнами миграции, географией и культурными традициями."
    },
    "navigation": {
      "title": "Быстрая навигация",
      "origin": "Происхождение фамилий",
      "distribution": "Географическое распределение",
      "culture": "Культура фамилий"
    }
  },
  "surnames": {
    "li": {
      "origin": "Происходит от потомков Бо И, взявших фамилию от должности «ли», позже измененной на «Ли». По другой версии, фамилия происходит от императора Яньди (Шэнь-нуна).",
      "history": "Ли — самая распространенная фамилия в Китае. Самой известной династией с фамилией Ли была династия Тан, основанная Ли Юанем. Фамилия Ли была распространена уже в период Весны и Осени и эпоху Воюющих Государств, достигнув своего пика в эпоху Тан.",
      "distribution": "Распространена по всему Китаю, особенно в провинциях Шэньси и Ганьсу",
      "famousPeople": {
        "liBai": "Ли Бай",
        "liQingZhao": "Ли Цинчжао",
        "liShangYin": "Ли Шанъинь",
        "liShiMin": "Ли Шиминь"
      }
    },
    "wang": {
      "origin": "Одна из древнейших фамилий, появившаяся в глубокой древности. По преданию, произошла от потомков Ван Хая.",
      "history": "Ван — вторая по распространенности фамилия в Китае, была уже значительной в период Весны и Осени. В истории существовало выражение «в Поднебесной фамилии Ван — сто восемьдесят тысяч дворов».",
      "distribution": "Распространена по всему Китаю, особенно в провинциях Шаньдун и Хэбэй",
      "famousPeople": {
        "wangXiZhi": "Ван Сичжи",
        "wangWei": "Ван Вэй",
        "wangAnShi": "Ван Аньши",
        "wangYangMing": "Ван Янмин"
      }
    },
    "zhang": {
      "origin": "Происходит с древних времен, по преданию, от потомков Чжан Хэ, изобретателя лука и стрел при Жёлтом Императоре.",
      "history": "Чжан — третья по распространенности фамилия в Китае, была значительной уже в период Весны и Осени и эпоху Воюющих Государств. В эпоху Хань Чжан Лян помогал Лю Бану основать династию Хань, что принесло фамилии Чжан ещё большую известность.",
      "distribution": "Распространена по всему Китаю, особенно в провинциях Хэнань и Шаньдун",
      "famousPeople": {
        "zhangLiang": "Чжан Лян",
        "zhangFei": "Чжан Фэй",
        "zhangZeDuan": "Чжан Цзэдуань",
        "zhangHeng": "Чжан Хэн"
      }
    },
    "liu": {
      "origin": "Происходит от фамилии Цзи, по преданию, от потомков Жёлтого Императора. Лю Лэй получил фамилию за умение приручать драконов-лошадей.",
      "history": "Лю — четвертая по распространенности фамилия в Китае. Самой знаменитой династией с фамилией Лю была династия Хань, основанная Лю Баном и правившая более 400 лет.",
      "distribution": "Распространена по всему Китаю, особенно в провинциях Хэнань, Шаньдун и Аньхой",
      "famousPeople": {
        "liuBang": "Лю Бан",
        "liuBei": "Лю Бэй",
        "liuYuXi": "Лю Юйси",
        "liuShaoQi": "Лю Шаоци"
      }
    },
    "chen": {
      "origin": "Происходит от фамилии Гуй, по преданию, от потомков императора Шуня. Получили фамилию от удела Чэнь (современный Хуайян, провинция Хэнань).",
      "history": "Чэнь — пятая по распространенности фамилия в Китае. В период Весны и Осени существовало государство Чэнь. В эпоху Южных и Северных династий существовала династия Чэнь.",
      "distribution": "Распространена по всему Китаю, особенно в провинциях Фуцзянь, Гуандун и Чжэцзян",
      "famousPeople": {
        "chenSheng": "Чэнь Шэн",
        "chenShou": "Чэнь Шоу",
        "chenZiAng": "Чэнь Цзыан",
        "chenDuXiu": "Чэнь Дусю"
      }
    },
    "yang": {
      "origin": "Происходит от фамилии Цзи, по преданию, от потомков девятого сына чжоуского Вэнь-вана Шу Лян-хэ. Получили фамилию от удела Ян.",
      "history": "Фамилия Ян была распространена уже в период Весны и Осени и эпоху Воюющих Государств. Основатель династии Суй, Ян Цзянь, сделал фамилию Ян еще более знаменитой.",
      "distribution": "Распространена по всему Китаю, особенно в провинциях Шэньси и Сычуань",
      "famousPeople": {
        "yangJian": "Ян Цзянь",
        "yangGuiFei": "Ян Гуйфэй",
        "yangYanZhao": "Ян Яньчжао",
        "yangJiang": "Ян Цзян"
      }
    },
    "zhao": {
      "origin": "Происходит от фамилии Ин, по преданию, от потомков Цзао Фу. Получили фамилию от города Чжаочэн (современный Хундун, провинция Шаньси).",
      "history": "Фамилия Чжао — одна из знаменитых фамилий в истории Китая. В эпоху Воюющих Государств существовало царство Чжао, основанное родом Чжао.",
      "distribution": "Распространена по всему Китаю, особенно в провинциях Шаньси и Хэбэй",
      "famousPeople": {
        "zhaoWuLingWang": "Чжао У-лин-ван",
        "zhaoKuangYin": "Чжао Куанъинь",
        "zhaoYun": "Чжао Юнь",
        "zhaoMengFu": "Чжао Мэнфу"
      }
    },
    "sun": {
      "origin": "Происходит от фамилии Цзи, по преданию, от потомков Сунь Шуду, сына чжоуского Вэнь-вана.",
      "history": "Фамилия Сунь была распространена уже в период Весны и Осени и эпоху Воюющих Государств. В эпоху Троецарствия Сунь Цюань основал царство У.",
      "distribution": "Распространена по всему Китаю, особенно в провинциях Шаньдун и Цзянсу",
      "famousPeople": {
        "sunWu": "Сунь У",
        "sunQuan": "Сунь Цюань",
        "sunYatSen": "Сунь Ятсен",
        "sunSiMiao": "Сунь Сымяо"
      }
    },
    "zhou": {
      "origin": "Происходит от фамилии Цзи, по преданию, от потомков чжоуского Вэнь-вана Цзи Чана.",
      "history": "Фамилия Чжоу — одна из древнейших фамилий Китая, правители династии Чжоу носили эту фамилию.",
      "distribution": "Распространена по всему Китаю, особенно в провинциях Хунань и Цзянси",
      "famousPeople": {
        "zhouGongDan": "Чжоу-гун Дань",
        "zhouDunYi": "Чжоу Дуньи",
        "zhouEnLai": "Чжоу Эньлай",
        "zhouShuRen": "Чжоу Шужэнь"
      }
    },
    "wu": {
      "origin": "Происходит от фамилии Цзи, по преданию, от потомков чжоуского У-вана Цзи Фа. Получили фамилию от удела У (современный Сучжоу, провинция Цзянсу).",
      "history": "Фамилия У была распространена уже в период Весны и Осени. В истории существовали государства с названием У.",
      "distribution": "Распространена по всему Китаю, особенно в провинциях Цзянсу и Чжэцзян",
      "famousPeople": {
        "wuQi": "У Ци",
        "wuDaoZi": "У Даоцзы",
        "wuChengEn": "У Чэнъэнь",
        "wuJingZi": "У Цзинцзы"
      }
    }
  }
}
