{
  "common": {
    "language": "اردو",
    "title": "سی سی نام - چینی ثقافت پر مبنی نام تجویز کرنے کا نظام",
    "description": "قدیم چینی شاعری، کلاسیکی تعلیمات، اور وو شنگ اور یی جنگ کے اصولوں پر مبنی نام تجویز کرنے کا نظام",
    "not_found": "صفحہ نہیں ملا",
    "path_not_exists": "یہ راستہ موجود نہیں ہے",
    "page_moved": "یہ صفحہ منتقل یا حذف کر دیا گیا ہو سکتا ہے",
    "back_home": "صفحہ اول پر واپس جائیں",
    "data_source_description": "بنیادی طریقہ تبدیلی کے لیے لک اپ ٹیبل استعمال کرتا ہے، جس کا ڈیٹا یہاں سے لیا گیا ہے",
    "hko_calendar_conversion": "ہانگ کانگ آبزرویٹری [شمسی اور قمری کیلنڈر کے درمیان تبدیلی]"
  },
  "header": {
    "home": "صفحہ اول",
    "surnameculture": "خاندانی نام کی ثقافت",
    "about": "ہمارے بارے میں",
    "login": "لاگ ان"
  },
  "home": {
    "slogan": "روایتی حکمت · جدید نام",
    "description": "'شیجنگ' اور 'چار کتابیں اور پانچ کلاسیکیات' سے روایتی ثقافت کا جوہر وو شنگ اور یی جنگ کی گہری حکمت کے ساتھ ملا کر آپ کے لیے ایک منفرد نام چارٹ بنایا گیا ہے۔",
    "wuxing": "پانچ عناصر",
    "wuxing_desc": "آپ کی پیدائش کی تاریخ اور وقت کی بنیاد پر، پانچ عناصر کی خصوصیات کو بالکل صحیح طور پر ملاتے ہوئے یہ یقینی بنانا کہ آپ کا نام آپ کی قسمت کے ساتھ ہم آہنگ ہو",
    "shijing": "شاعرانہ حوالہ جات",
    "shijing_desc": "اوڈز کی کتاب سے الہام لیتے ہوئے، کلاسیکی ثقافت کو شامل کرکے آپ کے نام میں گہری ثقافتی معنی ڈالنا",
    "wuxing_tooltip": "پانچ عناصر (دھات، لکڑی، پانی، آگ، زمین) قدیم چینی فلسفہ میں ایک اہم نظریہ ہیں جو قدرتی دنیا کی تشکیل اور اس کی حرکت اور تبدیلی کے قوانین کی وضاحت کرتا ہے۔ یہ نظریہ کہتا ہے کہ دنیا میں ہر چیز پانچ عناصر سے بنی ہے، جو ایک دوسرے کو فروغ دیتے اور قید کرتے ہیں: لکڑی آگ کو فروغ دیتی ہے، آگ زمین کو فروغ دیتی ہے، زمین دھات کو فروغ دیتی ہے، دھات پانی کو فروغ دیتی ہے، اور پانی لکڑی کو فروغ دیتا ہے۔ نام رکھنے میں، پانچ عناصر کے باہمی فروغ اور قید کا اصول کسی کی قسمت کو متوازن کرنے اور بدقسمتی سے بچتے ہوئے خوش قسمتی لانے میں مدد کر سکتا ہے۔",
    "shijing_tooltip": "'شیجنگ' (اوڈز کی کتاب) چین میں شاعری کا سب سے قدیم مجموعہ ہے، جس میں مغربی زاؤ سلطنت کے ابتدائی دور سے لے کر اسپرنگ اور آٹم کے دور کے درمیان (11ویں سے 6ویں صدی قبل مسیح) کی 311 نظمیں شامل ہیں۔ اس میں ثقافتی معنی خیز، خوبصورت تصاویر، اور گہری انسانی روح موجود ہے۔ نام رکھنے میں، 'شیجنگ' کے اشاروں اور تصاویر سے الہام لینا نہ صرف ناموں کو ایک وسیع ثقافتی بنیاد دیتا ہے، بلکہ چینی ثقافت کے جوہر کو بھی جاری رکھتا ہے۔",
    "hover_for_details": "تفصیلی تعارف کے لیے ہوور کریں",
    "shijing_quote": "گوان-گوان آسپرے چیختے ہیں، دریا میں چھوٹے جزیرے پر۔ معتدل، شائستہ، پرہیزگار، نوجوان خاتون: ہمارے شہزادے کے لیے ایک اچھی ساتھی۔",
    "shijing_source": "اوڈز کی کتاب، گوانجو",
    "classics_in_naming": "نام رکھنے میں کلاسیکی ثقافت کا اطلاق",
    "classics_point1": "شیجنگ اور چوچی جیسے کلاسیکیوں سے خوبصورت تصاویر نکالنا",
    "classics_point2": "ناموں کو گہری معنی دینے کے لیے روایتی ثقافتی سیاق و سباق کو شامل کرنا",
    "classics_point3": "چینی تہذیب کے جوہر کو وراثت میں لینا، قدیم اور جدید ثقافت کو جوڑنا",
    "shijing_naming": "ایک اچھا نام محض حروف کا مجموعہ نہیں، بلکہ روایتی ثقافت کی وراثت اور جدت ہے۔",
    "wuxing_naming": "نام رکھنے میں پانچ عناصر کا اطلاق: توازن حاصل کرنے کے لیے پیدائشی چارٹ میں کمی کی بنیاد پر مماثل خصوصیات والے حروف کا انتخاب کرنا۔",
    "metal_desc": "مضبوط اور پختہ، فیصلہ کن اور خزاں کی علامت",
    "wood_desc": "بڑھتا ہوا اور لچکدار، جدت اور بہار کی علامت",
    "water_desc": "بہنے والا اور دانشمند، موافقت اور سرما کی علامت",
    "fire_desc": "جذباتی اور توانائی سے بھرپور، تبدیلی اور گرمی کی علامت",
    "earth_desc": "مستحکم اور جامع، ہم آہنگی اور آخری موسموں کی علامت",
    "intro_title": "روایتی چینی نام رکھنے کے فلسفے کی تلاش"
  },
  "form": {
    "title": "اپنا مقدر والا نام تلاش کریں",
    "birthdate": "پیدائش کی تاریخ",
    "birthdate_placeholder": "تاریخ منتخب کریں",
    "birthdate_required": "پیدائش کی تاریخ درکار ہے",
    "birthdate_invalid": "درست تاریخ درج کریں",
    "birthtime": "پیدائش کا وقت",
    "gender": "جنس",
    "male": "مرد",
    "female": "عورت",
    "neutral": "غیر جانبدار",
    "surname": "خاندانی نام",
    "surname_placeholder": "اپنا خاندانی نام درج کریں (اختیاری)",
    "surname_error": "براہ کرم 1-2 چینی حروف درج کریں",
    "date_error": "براہ کرم درست تاریخ کی شکل استعمال کریں: yyyy/MM/dd",
    "submit": "نام کی تجاویز پیدا کریں",
    "loading": "تیار کر رہے ہیں...",
    "generation_error": "نام تیار کرتے وقت خرابی، دوبارہ کوشش کریں",
    "form_title": "بنیادی معلومات درج کریں",
    "time_range": "پیدائش کا وقت",
    "time_range_morning": "صبح (زی وقت-ماؤ وقت)",
    "time_range_afternoon": "دن (چین وقت-وی وقت)",
    "time_range_evening": "شام (شین وقت-ژو وقت)",
    "time_range_night": "رات (ہای وقت-چو وقت)",
    "network_timeout_error": "نیٹ ورک درخواست کا وقت ختم ہو گیا، براہ کرم اپنا کنکشن چیک کریں اور دوبارہ کوشش کریں",
    "try_again": "دوبارہ کوشش کریں",
    "name_generating": "ہم آپ کے لیے تخصیص کردہ نام کی تجاویز تیار کرنے کے لیے محنت کر رہے ہیں، براہ کرم انتظار کریں...",
    "almost_done": "تقریباً مکمل ہو گیا، بس ایک لمحے کا انتظار...",
    "timezones": {
      "zi": "زی گھنٹہ (0:00-2:00)",
      "chou": "چو گھنٹہ (2:00-4:00)",
      "yin": "ین گھنٹہ (4:00-6:00)",
      "mao": "ماؤ گھنٹہ (6:00-8:00)",
      "chen": "چین گھنٹہ (8:00-10:00)",
      "si": "سی گھنٹہ (10:00-12:00)",
      "wu": "وو گھنٹہ (12:00-14:00)",
      "wei": "وی گھنٹہ (14:00-16:00)",
      "shen": "شین گھنٹہ (16:00-18:00)",
      "you": "یو گھنٹہ (18:00-20:00)",
      "xu": "ژو گھنٹہ (20:00-22:00)",
      "hai": "ہای گھنٹہ (22:00-24:00)"
    }
  },
  "result": {
    "title": "آپ کے نام کا تجزیہ",
    "introduction": "آپ کی پیدائش کی معلومات کی بنیاد پر، ہم نے آپ کے لیے مندرجہ ذیل نام کی سفارشات تیار کی ہیں:",
    "name_recommendation": "تجویز کردہ نام",
    "five_elements": "پانچ عناصر کا تجزیہ",
    "poetic_reference": "شاعرانہ حوالہ",
    "name_meaning": "نام کا مطلب",
    "name_score": "نام کا اسکور",
    "compatibility": "پیدائش چارٹ کی مطابقت",
    "cultural_depth": "ثقافتی گہرائی",
    "uniqueness": "انفرادیت",
    "pronunciation": "صوتی جمالیات",
    "try_again": "دوبارہ تیار کریں",
    "back_to_home": "صفحہ اول پر واپس جائیں",
    "name_analysis": "پانچ عناصر کا استدلال",
    "language_notice": "اس صفحہ پر زبان کی تبدیلی کی خصوصیت غیر فعال ہے۔ زبان تبدیل کرنے کے لیے، براہ کرم ہوم پیج پر واپس جائیں۔",
    "elements": {
      "metal": "دھات",
      "wood": "لکڑی",
      "water": "پانی",
      "fire": "آگ",
      "earth": "زمین"
    }
  },
  "footer": {
    "copyright": "© 2025 سی سی نام۔ جملہ حقوق محفوظ ہیں۔",
    "privacy": "رازداری کی پالیسی",
    "terms": "استعمال کی شرائط",
    "contact": "ہم سے رابطہ کریں"
  },
  "feedback": {
    "title": "صارف کی رائے",
    "anonymous": "گمنام صارف",
    "name_label": "آپ کا نام (اختیاری)",
    "email_label": "ای میل (اختیاری)",
    "message_label": "رائے کا مواد",
    "submit": "رائے بھیجیں",
    "submitting": "بھیج رہے ہیں...",
    "thank_you": "آپ کی رائے کے لیے شکریہ! ہم آپ کی تجاویز پر غور کریں گے۔",
    "continue": "مزید رائے دیں",
    "error_message": "جمع کرانے میں ناکامی، براہ کرم بعد میں دوبارہ کوشش کریں یا دوسرے ذرائع سے ہم سے رابطہ کریں۔",
    "timeout_message": "جمع کرانے کا وقت ختم ہوگیا، براہ کرم اپنا نیٹ ورک کنکشن چیک کریں اور دوبارہ کوشش کریں۔"
  },
  "about": {
    "title": "ہمارے بارے میں",
    "intro": {
      "p1": "ہم ایک ٹیم ہیں جو روایتی چینی ثقافت کی وراثت کے لیے وقف ہے، ثقافتی میراث کے ساتھ نام کی سفارش کی خدمات فراہم کرنے پر توجہ مرکوز کیے ہوئے ہے۔",
      "p2": "روایتی نام کے اصولوں اور جدید ڈیٹا تجزیہ کو ملا کر، ہم ہر خاندان کے لیے منفرد اور بامعنی نام کے اختیارات فراہم کرتے ہیں۔"
    },
    "philosophy": {
      "title": "ہمارا فلسفہ",
      "item1": "روایت کا احترام، ثقافت کی وراثت",
      "item2": "سائنسی تجزیہ، درست سفارشات",
      "item3": "پیشہ ورانہ خدمت، احتیاط سے دیکھ بھال"
    },
    "advantages": {
      "title": "ہمارے فوائد",
      "team": {
        "title": "پیشہ ور ٹیم",
        "description": "نام رکھنے کے سالوں کے تجربے کے ساتھ ایک پیشہ ور ٹیم، روایتی ثقافت کے جوہر سے گہری واقفیت رکھتی ہے"
      },
      "method": {
        "title": "سائنسی طریقہ",
        "description": "روایتی ثقافت کو جدید تجزیاتی طریقوں کے ساتھ ملا کر آپ کو بہترین سفارشات فراہم کرنا"
      }
    },
    "contact": {
      "intro": "اگر آپ کے کوئی سوالات یا تجاویز ہیں، تو براہ کرم ہم سے رابطہ کرنے میں ہچکچاہٹ محسوس نہ کریں",
      "email": {
        "title": "ای میل"
      }
    }
  },
  "surname": {
    "title": "چینی خاندانی نام کی ثقافت",
    "subtitle": "پانچ ہزار سال کے خاندانی ناموں کے آغاز کی تلاش، چینی تہذیب کی وراثت",
    "banner": {
      "alt": "سو خاندانی ناموں کی تاریخ"
    },
    "wiki_link": "مزید خاندانی ناموں کی جانکاری تلاش کریں",
    "origin": {
      "title": "خاندانی ناموں کا آغاز اور ارتقاء",
      "description": "چینی خاندانی نام کی ثقافت کی ایک طویل تاریخ ہے، جو قدیم زمانے تک واپس جاتی ہے۔ ابتدائی طور پر 'شنگ' (姓) اور 'شی' (氏) کے درمیان فرق تھا: 'شنگ' خون کے رشتوں کی نمائندگی کرتا تھا، جبکہ 'شی' سماجی حیثیت یا جغرافیائی علاقے کی نشاندہی کرتا تھا۔"
    },
    "distribution": {
      "title": "سو خاندانی نام اور علاقائی تقسیم",
      "ranking": "خاندانی ناموں کی درجہ بندی",
      "ranking_desc": "چین میں فی الحال سب سے عام خاندانی نام لی، وانگ، ژانگ، لیو، چین وغیرہ ہیں۔ ان خاندانی ناموں کی تقسیم اور نقل مکانی چینی تاریخ میں آبادی کی نقل و حرکت اور ثقافتی انضمام کی عکاسی کرتی ہے۔",
      "regional": "علاقائی خصوصیات",
      "regional_desc": "جنوبی علاقوں میں عام خاندانی نام شمال کے مقابلے میں مختلف ہیں، جو تاریخی ہجرت کی لہروں، جغرافیائی ماحول، اور ثقافتی روایات سے قریبی تعلق رکھتے ہیں۔"
    },
    "navigation": {
      "title": "فوری نیویگیشن",
      "origin": "خاندانی ناموں کا آغاز",
      "distribution": "علاقائی تقسیم",
      "culture": "خاندانی نام کی ثقافت"
    }
  },
  "surnames": {
    "li": {
      "origin": "بو یی کی اولاد سے منسوب، ابتدائی طور پر سرکاری عہدے \"لی\" سے لیا گیا، بعد میں \"لی\" میں تبدیل کیا گیا۔ ایک روایت کے مطابق یان امپریر (شین نونگ) سے بھی اس کا تعلق ہے۔",
      "history": "لی چین کا سب سے بڑا خاندانی نام ہے۔ تاریخ میں لی خاندان کی سب سے مشہور سلطنت تانگ سلطنت تھی، جسے لی یوان نے قائم کیا۔ لی خاندانی نام بہار اور خزاں کے دور میں پہلے سے عام تھا اور تانگ سلطنت کے دوران اپنے عروج پر پہنچا۔",
      "distribution": "پورے ملک میں پھیلا ہوا ہے، خاص طور پر شآنکسی اور گانسو صوبوں میں زیادہ مرکوز ہے",
      "famousPeople": {
        "liBai": "لی بائی",
        "liQingZhao": "لی چنگژاؤ",
        "liShangYin": "لی شانگ ین",
        "liShiMin": "لی شی من"
      }
    },
    "wang": {
      "origin": "قدیم زمانے سے منسوب، یہ قدیم ترین خاندانی ناموں میں سے ایک ہے۔ افسانوی طور پر وانگ ہائی کی اولاد کی طرف منسوب ہے۔",
      "history": "وانگ چین کا دوسرا سب سے بڑا خاندانی نام ہے۔ بہار اور خزاں کے دور میں یہ پہلے سے ایک بڑا خاندانی نام تھا۔ تاریخی طور پر کہا جاتا ہے کہ \"آسمان کے نیچے وانگ خاندان کے اٹھارہ لاکھ گھر تھے\"۔",
      "distribution": "پورے ملک میں وسیع پیمانے پر پھیلا ہوا ہے، خاص طور پر شاندونگ اور ہیبی صوبوں میں زیادہ مرکوز ہے",
      "famousPeople": {
        "wangXiZhi": "وانگ شی ژی",
        "wangWei": "وانگ وی",
        "wangAnShi": "وانگ آن شی",
        "wangYangMing": "وانگ یانگ منگ"
      }
    },
    "zhang": {
      "origin": "قدیم زمانے سے منسوب، افسانوی طور پر پیلے امپریر کے دور میں تیر کمان کے مخترع ژانگ ہو کی اولاد سے منسوب ہے۔",
      "history": "ژانگ چین کا تیسرا سب سے بڑا خاندانی نام ہے۔ جنگجو ریاستوں کے دور میں یہ پہلے سے مشہور تھا۔ ہان سلطنت کے دوران ژانگ لیانگ نے لیو بانگ کی ہان سلطنت کی تاسیس میں مدد کی، جس سے ژانگ خاندانی نام کا وقار مزید بڑھا۔",
      "distribution": "پورے ملک میں وسیع پیمانے پر پھیلا ہوا ہے، خاص طور پر ہینان اور شاندونگ صوبوں میں زیادہ مرکوز ہے",
      "famousPeople": {
        "zhangLiang": "ژانگ لیانگ",
        "zhangFei": "ژانگ فی",
        "zhangZeDuan": "ژانگ زے دوان",
        "zhangHeng": "ژانگ ہینگ"
      }
    },
    "liu": {
      "origin": "جی خاندان سے منسوب، افسانوی طور پر پیلے امپریر کی اولاد سے منسوب ہے۔ لیو لے کو ڈریگن گھوڑوں کو تربیت دینے میں مہارت کی وجہ سے لیو خاندانی نام ملا۔",
      "history": "لیو چین کا چوتھا سب سے بڑا خاندانی نام ہے۔ تاریخ میں لیو خاندان کی سب سے نمایاں سلطنت ہان سلطنت تھی، جسے لیو بانگ نے قائم کیا اور جو چار سو سال سے زیادہ چلی۔",
      "distribution": "پورے ملک میں وسیع پیمانے پر پھیلا ہوا ہے، خاص طور پر ہینان، شاندونگ اور انہوئی صوبوں میں زیادہ مرکوز ہے",
      "famousPeople": {
        "liuBang": "لیو بانگ",
        "liuBei": "لیو بیئی",
        "liuYuXi": "لیو یو شی",
        "liuShaoQi": "لیو شاؤچی"
      }
    },
    "chen": {
      "origin": "گوئی خاندان سے منسوب، افسانوی طور پر شن امپریر کی اولاد سے منسوب ہے۔ چین (موجودہ ہینان کا ہوائی یانگ) میں جاگیر کی وجہ سے یہ خاندانی نام ملا۔",
      "history": "چین چین کا پانچواں سب سے بڑا خاندانی نام ہے۔ بہار اور خزاں کے دور میں چین ریاست قائم کی گئی تھی۔ جنوبی سلطنتوں کے دور میں چین سلطنت بھی ظاہر ہوئی۔",
      "distribution": "پورے ملک میں وسیع پیمانے پر پھیلا ہوا ہے، خاص طور پر فوجیان، گوانگدونگ اور ژیجیانگ صوبوں میں زیادہ مرکوز ہے",
      "famousPeople": {
        "chenSheng": "چین شینگ",
        "chenShou": "چین شو",
        "chenZiAng": "چین زی آنگ",
        "chenDuXiu": "چین دو شیو"
      }
    },
    "yang": {
      "origin": "جی خاندان سے منسوب، افسانوی طور پر ژو کے ملک وین کے نویں بیٹے شو لیانگ ہے کی اولاد سے منسوب ہے۔ یانگ یی میں جاگیر کی وجہ سے یہ خاندانی نام ملا۔",
      "history": "یانگ جنگجو ریاستوں کے دور میں پہلے سے عام تھا۔ سوئی سلطنت کے بانی یانگ جیان نے یانگ خاندانی نام کو مزید وقار بخشا۔",
      "distribution": "پورے ملک میں وسیع پیمانے پر پھیلا ہوا ہے، خاص طور پر شآنکسی اور سیچوان صوبوں میں زیادہ مرکوز ہے",
      "famousPeople": {
        "yangJian": "یانگ جیان",
        "yangGuiFei": "یانگ گوئی فی",
        "yangYanZhao": "یانگ یان ژاؤ",
        "yangJiang": "یانگ جیانگ"
      }
    },
    "zhao": {
      "origin": "ینگ خاندان سے منسوب، افسانوی طور پر زاؤفو کی اولاد سے منسوب ہے۔ ژاؤ شہر (موجودہ شانکسی کا ہونگدونگ) میں جاگیر کی وجہ سے یہ خاندانی نام ملا۔",
      "history": "ژاؤ چین کی تاریخ میں ایک مشہور خاندانی نام ہے۔ جنگجو ریاستوں کے دور میں ژاؤ ریاست ژاؤ خاندان نے قائم کی تھی۔",
      "distribution": "پورے ملک میں وسیع پیمانے پر پھیلا ہوا ہے، خاص طور پر شانکسی اور ہیبی صوبوں میں زیادہ مرکوز ہے",
      "famousPeople": {
        "zhaoWuLingWang": "ژاؤ وو لنگ وانگ",
        "zhaoKuangYin": "ژاؤ کوانگ ین",
        "zhaoYun": "ژاؤ یون",
        "zhaoMengFu": "ژاؤ مینگ فو"
      }
    },
    "sun": {
      "origin": "جی خاندان سے منسوب، افسانوی طور پر ژو کے ملک وین کے بیٹے سن شوڈو کی اولاد سے منسوب ہے۔",
      "history": "سن بہار اور خزاں کے دور میں پہلے سے عام تھا۔ تین سلطنتوں کے دور میں سن چوان نے وو ریاست قائم کی۔",
      "distribution": "پورے ملک میں وسیع پیمانے پر پھیلا ہوا ہے، خاص طور پر شاندونگ اور جیانگسو صوبوں میں زیادہ مرکوز ہے",
      "famousPeople": {
        "sunWu": "سن وو",
        "sunQuan": "سن چوان",
        "sunYatSen": "سن یات سین",
        "sunSiMiao": "سن سی میاؤ"
      }
    },
    "zhou": {
      "origin": "جی خاندان سے منسوب، افسانوی طور پر ژو کے ملک وین جی چانگ کی اولاد سے منسوب ہے۔",
      "history": "ژو چین کے قدیم ترین خاندانی ناموں میں سے ایک ہے۔ ژو سلطنت کے حکمران ژو خاندان سے تھے۔",
      "distribution": "پورے ملک میں وسیع پیمانے پر پھیلا ہوا ہے، خاص طور پر ہونان اور جیانگژی صوبوں میں زیادہ مرکوز ہے",
      "famousPeople": {
        "zhouGongDan": "ژو گونگ دان",
        "zhouDunYi": "ژو دون یی",
        "zhouEnLai": "ژو این لائی",
        "zhouShuRen": "ژو شو رین"
      }
    },
    "wu": {
      "origin": "جی خاندان سے منسوب، افسانوی طور پر ژو کے ملک وو جی فا کی اولاد سے منسوب ہے۔ وو (موجودہ جیانگسو کا سوژو) میں جاگیر کی وجہ سے یہ خاندانی نام ملا۔",
      "history": "وو بہار اور خزاں کے دور میں پہلے سے عام تھا۔ تاریخی طور پر وو ریاست جیسی ریاستیں موجود تھیں۔",
      "distribution": "پورے ملک میں وسیع پیمانے پر پھیلا ہوا ہے، خاص طور پر جیانگسو اور ژیجیانگ صوبوں میں زیادہ مرکوز ہے",
      "famousPeople": {
        "wuQi": "وو چی",
        "wuDaoZi": "وو داؤ زی",
        "wuChengEn": "وو چینگ این",
        "wuJingZi": "وو جنگ زی"
      }
    }
  }
}
